Omniment-public/RECore-Arduino_Core_STM32_old/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification

menu.pnum=Board part number

menu.xserial=U(S)ART support
menu.usb=USB support (if available)
menu.xusb=USB speed (if available)
menu.virtio=Virtual serial support

menu.opt=Optimize
menu.rtlib=C Runtime Library
menu.upload_method=Upload method

################################################################################
# Nucleo 144 boards
# 
# Nucleo_144.name=Nucleo-144
# 
# Nucleo_144.build.core=arduino
# Nucleo_144.build.board=Nucleo_144
# Nucleo_144.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
# 
# # NUCLEO_F207ZG board
# # Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
# Nucleo_144.menu.pnum.NUCLEO_F207ZG=Nucleo F207ZG
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.node=NODE_F207ZG
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.upload.maximum_size=1048576
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.upload.maximum_data_size=131072
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.mcu=cortex-m3
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.board=NUCLEO_F207ZG
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.series=STM32F2xx
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.product_line=STM32F207xx
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.variant=NUCLEO_F207ZG
# Nucleo_144.menu.pnum.NUCLEO_F207ZG.build.cmsis_lib_gcc=arm_cortexM3l_math
# 
# # NUCLEO_F429ZI board
# # Support: USB HID, Serial1 (USART1 on PG9, PG14) and Serial2 (USART2 on PD6, PD5)
# Nucleo_144.menu.pnum.NUCLEO_F429ZI=Nucleo F429ZI
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.node=NODE_F429ZI
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.upload.maximum_size=2097152
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.upload.maximum_data_size=196608
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.mcu=cortex-m4
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.board=NUCLEO_F429ZI
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.series=STM32F4xx
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.product_line=STM32F429xx
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.variant=NUCLEO_F429ZI
# Nucleo_144.menu.pnum.NUCLEO_F429ZI.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_F746ZG board
# Nucleo_144.menu.pnum.NUCLEO_F746ZG=Nucleo F746ZG
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.node=NODE_F746ZG
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.upload.maximum_size=1048576
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.upload.maximum_data_size=327680
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.mcu=cortex-m7
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.board=NUCLEO_F746ZG
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.series=STM32F7xx
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.product_line=STM32F746xx
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.variant=NUCLEO_F7x6ZG
# Nucleo_144.menu.pnum.NUCLEO_F746ZG.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
# 
# # NUCLEO_F756ZG board
# Nucleo_144.menu.pnum.NUCLEO_F756ZG=Nucleo F756ZG
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.node=NODE_F756ZG
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.upload.maximum_size=1048576
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.upload.maximum_data_size=327680
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.mcu=cortex-m7
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.board=NUCLEO_F756ZG
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.series=STM32F7xx
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.product_line=STM32F756xx
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.variant=NUCLEO_F7x6ZG
# Nucleo_144.menu.pnum.NUCLEO_F756ZG.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
# 
# # NUCLEO_F767ZI board
# Nucleo_144.menu.pnum.NUCLEO_F767ZI=Nucleo F767ZI
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.node=NODE_F767ZI
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.upload.maximum_size=2097152
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.upload.maximum_data_size=524288
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.mcu=cortex-m7
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.board=NUCLEO_F767ZI
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.series=STM32F7xx
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.product_line=STM32F767xx
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.variant=NUCLEO_F767ZI
# Nucleo_144.menu.pnum.NUCLEO_F767ZI.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
# 
# # NUCLEO_H743ZI board
# Nucleo_144.menu.pnum.NUCLEO_H743ZI=Nucleo H743ZI
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.node=NODE_H743ZI
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.upload.maximum_size=2097152
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.upload.maximum_data_size=524288
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.mcu=cortex-m7
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.board=NUCLEO_H743ZI
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.series=STM32H7xx
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.product_line=STM32H743xx
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.variant=NUCLEO_H743ZI
# Nucleo_144.menu.pnum.NUCLEO_H743ZI.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
# 
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2=Nucleo H743ZI2
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.node="NODE_H743ZI,NOD_H743ZI2"
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.upload.maximum_size=2097152
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.upload.maximum_data_size=524288
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.build.mcu=cortex-m7
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.build.board=NUCLEO_H743ZI2
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.build.series=STM32H7xx
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.build.product_line=STM32H743xx
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.build.variant=NUCLEO_H743ZI
# Nucleo_144.menu.pnum.NUCLEO_H743ZI2.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
# 
# # NUCLEO_L496ZG board
# Nucleo_144.menu.pnum.NUCLEO_L496ZG=Nucleo L496ZG
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.node=NODE_L496ZG
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.upload.maximum_size=1048576
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.upload.maximum_data_size=327680
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.build.mcu=cortex-m4
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.build.board=NUCLEO_L496ZG
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.build.series=STM32L4xx
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.build.product_line=STM32L496xx
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.build.variant=NUCLEO_L496ZG
# Nucleo_144.menu.pnum.NUCLEO_L496ZG.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_L496ZG-P board
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P=Nucleo L496ZG-P
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.node=NODE_L496ZG
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.upload.maximum_size=1048576
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.upload.maximum_data_size=327680
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.build.mcu=cortex-m4
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.build.board=NUCLEO_L496ZG_P
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.build.series=STM32L4xx
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.build.product_line=STM32L496xx
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.build.variant=NUCLEO_L496ZG
# Nucleo_144.menu.pnum.NUCLEO_L496ZG-P.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_L4R5ZI board
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI=Nucleo L4R5ZI
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.node=NODE_L4R5ZI
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.upload.maximum_size=2097152
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.upload.maximum_data_size=655360
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.build.mcu=cortex-m4
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.build.board=NUCLEO_L4R5ZI
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.build.series=STM32L4xx
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.build.product_line=STM32L4R5xx
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.build.variant=NUCLEO_L4R5ZI
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_L4R5ZI-P board
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P=Nucleo L4R5ZI-P
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.node=NODE_L4R5ZI
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.upload.maximum_size=2097152
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.upload.maximum_data_size=655360
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.build.mcu=cortex-m4
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.build.board=NUCLEO_L4R5ZI_P
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.build.series=STM32L4xx
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.build.product_line=STM32L4R5xx
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.build.variant=NUCLEO_L4R5ZI
# Nucleo_144.menu.pnum.NUCLEO_L4R5ZI-P.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # Upload menu
# Nucleo_144.menu.upload_method.MassStorage=Mass Storage
# Nucleo_144.menu.upload_method.MassStorage.upload.protocol=
# Nucleo_144.menu.upload_method.MassStorage.upload.tool=massStorageCopy
# 
# Nucleo_144.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# Nucleo_144.menu.upload_method.swdMethod.upload.protocol=0
# Nucleo_144.menu.upload_method.swdMethod.upload.options=-g
# Nucleo_144.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# Nucleo_144.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# Nucleo_144.menu.upload_method.serialMethod.upload.protocol=1
# Nucleo_144.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# Nucleo_144.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# Nucleo_144.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# Nucleo_144.menu.upload_method.dfuMethod.upload.protocol=2
# Nucleo_144.menu.upload_method.dfuMethod.upload.options=-g
# Nucleo_144.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# ################################################################################
# # Nucleo 64 boards
# 
# Nucleo_64.name=Nucleo-64
# 
# Nucleo_64.build.core=arduino
# Nucleo_64.build.board=Nucleo_64
# Nucleo_64.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
# 
# # NUCLEO_F030R8 board
# Nucleo_64.menu.pnum.NUCLEO_F030R8=Nucleo F030R8
# Nucleo_64.menu.pnum.NUCLEO_F030R8.node="NODE_F030R8,NUCLEO"
# Nucleo_64.menu.pnum.NUCLEO_F030R8.upload.maximum_size=65536
# Nucleo_64.menu.pnum.NUCLEO_F030R8.upload.maximum_data_size=8192
# Nucleo_64.menu.pnum.NUCLEO_F030R8.build.mcu=cortex-m0
# Nucleo_64.menu.pnum.NUCLEO_F030R8.build.board=NUCLEO_F030R8
# Nucleo_64.menu.pnum.NUCLEO_F030R8.build.series=STM32F0xx
# Nucleo_64.menu.pnum.NUCLEO_F030R8.build.product_line=STM32F030x8
# Nucleo_64.menu.pnum.NUCLEO_F030R8.build.variant=NUCLEO_F030R8
# Nucleo_64.menu.pnum.NUCLEO_F030R8.build.cmsis_lib_gcc=arm_cortexM0l_math
# 
# # NUCLEO_F072RB board
# Nucleo_64.menu.pnum.NUCLEO_F072RB=Nucleo F072RB
# Nucleo_64.menu.pnum.NUCLEO_F072RB.node="NODE_F072RB,NUCLEO"
# Nucleo_64.menu.pnum.NUCLEO_F072RB.upload.maximum_size=131072
# Nucleo_64.menu.pnum.NUCLEO_F072RB.upload.maximum_data_size=16384
# Nucleo_64.menu.pnum.NUCLEO_F072RB.build.mcu=cortex-m0
# Nucleo_64.menu.pnum.NUCLEO_F072RB.build.board=NUCLEO_F072RB
# Nucleo_64.menu.pnum.NUCLEO_F072RB.build.series=STM32F0xx
# Nucleo_64.menu.pnum.NUCLEO_F072RB.build.product_line=STM32F072xB
# Nucleo_64.menu.pnum.NUCLEO_F072RB.build.variant=NUCLEO_F072RB
# Nucleo_64.menu.pnum.NUCLEO_F072RB.build.cmsis_lib_gcc=arm_cortexM0l_math
# 
# # NUCLEO_F091RC board
# Nucleo_64.menu.pnum.NUCLEO_F091RC=Nucleo F091RC
# Nucleo_64.menu.pnum.NUCLEO_F091RC.node=NODE_F091RC
# Nucleo_64.menu.pnum.NUCLEO_F091RC.upload.maximum_size=262144
# Nucleo_64.menu.pnum.NUCLEO_F091RC.upload.maximum_data_size=32768
# Nucleo_64.menu.pnum.NUCLEO_F091RC.build.mcu=cortex-m0
# Nucleo_64.menu.pnum.NUCLEO_F091RC.build.board=NUCLEO_F091RC
# Nucleo_64.menu.pnum.NUCLEO_F091RC.build.series=STM32F0xx
# Nucleo_64.menu.pnum.NUCLEO_F091RC.build.product_line=STM32F091xC
# Nucleo_64.menu.pnum.NUCLEO_F091RC.build.variant=NUCLEO_F091RC
# Nucleo_64.menu.pnum.NUCLEO_F091RC.build.cmsis_lib_gcc=arm_cortexM0l_math
# 
# # NUCLEO_F103RB board
# Nucleo_64.menu.pnum.NUCLEO_F103RB=Nucleo F103RB
# Nucleo_64.menu.pnum.NUCLEO_F103RB.node="NODE_F103RB,NUCLEO"
# Nucleo_64.menu.pnum.NUCLEO_F103RB.upload.maximum_size=131072
# Nucleo_64.menu.pnum.NUCLEO_F103RB.upload.maximum_data_size=20480
# Nucleo_64.menu.pnum.NUCLEO_F103RB.build.mcu=cortex-m3
# Nucleo_64.menu.pnum.NUCLEO_F103RB.build.board=NUCLEO_F103RB
# Nucleo_64.menu.pnum.NUCLEO_F103RB.build.series=STM32F1xx
# Nucleo_64.menu.pnum.NUCLEO_F103RB.build.product_line=STM32F103xB
# Nucleo_64.menu.pnum.NUCLEO_F103RB.build.variant=NUCLEO_F103RB
# Nucleo_64.menu.pnum.NUCLEO_F103RB.build.cmsis_lib_gcc=arm_cortexM3l_math
# 
# # NUCLEO_F302R8 board
# Nucleo_64.menu.pnum.NUCLEO_F302R8=Nucleo F302R8
# Nucleo_64.menu.pnum.NUCLEO_F302R8.node=NODE_F302R8
# Nucleo_64.menu.pnum.NUCLEO_F302R8.upload.maximum_size=65536
# Nucleo_64.menu.pnum.NUCLEO_F302R8.upload.maximum_data_size=16384
# Nucleo_64.menu.pnum.NUCLEO_F302R8.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_F302R8.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_F302R8.build.board=NUCLEO_F302R8
# Nucleo_64.menu.pnum.NUCLEO_F302R8.build.series=STM32F3xx
# Nucleo_64.menu.pnum.NUCLEO_F302R8.build.product_line=STM32F302x8
# Nucleo_64.menu.pnum.NUCLEO_F302R8.build.variant=NUCLEO_F302R8
# Nucleo_64.menu.pnum.NUCLEO_F302R8.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_F303RE board
# Nucleo_64.menu.pnum.NUCLEO_F303RE=Nucleo F303RE
# Nucleo_64.menu.pnum.NUCLEO_F303RE.node=NODE_F303RE
# Nucleo_64.menu.pnum.NUCLEO_F303RE.upload.maximum_size=524288
# Nucleo_64.menu.pnum.NUCLEO_F303RE.upload.maximum_data_size=65536
# Nucleo_64.menu.pnum.NUCLEO_F303RE.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_F303RE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_F303RE.build.board=NUCLEO_F303RE
# Nucleo_64.menu.pnum.NUCLEO_F303RE.build.series=STM32F3xx
# Nucleo_64.menu.pnum.NUCLEO_F303RE.build.product_line=STM32F303xE
# Nucleo_64.menu.pnum.NUCLEO_F303RE.build.variant=NUCLEO_F303RE
# Nucleo_64.menu.pnum.NUCLEO_F303RE.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_F401RE board
# Nucleo_64.menu.pnum.NUCLEO_F401RE=Nucleo F401RE
# Nucleo_64.menu.pnum.NUCLEO_F401RE.node=NODE_F401RE
# Nucleo_64.menu.pnum.NUCLEO_F401RE.upload.maximum_size=524288
# Nucleo_64.menu.pnum.NUCLEO_F401RE.upload.maximum_data_size=98304
# Nucleo_64.menu.pnum.NUCLEO_F401RE.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_F401RE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_F401RE.build.board=NUCLEO_F401RE
# Nucleo_64.menu.pnum.NUCLEO_F401RE.build.series=STM32F4xx
# Nucleo_64.menu.pnum.NUCLEO_F401RE.build.product_line=STM32F401xE
# Nucleo_64.menu.pnum.NUCLEO_F401RE.build.variant=NUCLEO_F4x1RE
# Nucleo_64.menu.pnum.NUCLEO_F401RE.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_F411RE board
# Nucleo_64.menu.pnum.NUCLEO_F411RE=Nucleo F411RE
# Nucleo_64.menu.pnum.NUCLEO_F411RE.node="NODE_F411RE,NUCLEO"
# Nucleo_64.menu.pnum.NUCLEO_F411RE.upload.maximum_size=524288
# Nucleo_64.menu.pnum.NUCLEO_F411RE.upload.maximum_data_size=131072
# Nucleo_64.menu.pnum.NUCLEO_F411RE.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_F411RE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_F411RE.build.board=NUCLEO_F411RE
# Nucleo_64.menu.pnum.NUCLEO_F411RE.build.series=STM32F4xx
# Nucleo_64.menu.pnum.NUCLEO_F411RE.build.product_line=STM32F411xE
# Nucleo_64.menu.pnum.NUCLEO_F411RE.build.variant=NUCLEO_F4x1RE
# Nucleo_64.menu.pnum.NUCLEO_F411RE.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_F446RE board
# Nucleo_64.menu.pnum.NUCLEO_F446RE=Nucleo F446RE
# Nucleo_64.menu.pnum.NUCLEO_F446RE.node=NODE_F446RE
# Nucleo_64.menu.pnum.NUCLEO_F446RE.upload.maximum_size=524288
# Nucleo_64.menu.pnum.NUCLEO_F446RE.upload.maximum_data_size=131072
# Nucleo_64.menu.pnum.NUCLEO_F446RE.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_F446RE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_F446RE.build.board=NUCLEO_F446RE
# Nucleo_64.menu.pnum.NUCLEO_F446RE.build.series=STM32F4xx
# Nucleo_64.menu.pnum.NUCLEO_F446RE.build.product_line=STM32F446xx
# Nucleo_64.menu.pnum.NUCLEO_F446RE.build.variant=NUCLEO_F446RE
# Nucleo_64.menu.pnum.NUCLEO_F446RE.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_G071RB board
# Nucleo_64.menu.pnum.NUCLEO_G071RB=Nucleo G071RB
# Nucleo_64.menu.pnum.NUCLEO_G071RB.node=NODE_G071RB
# Nucleo_64.menu.pnum.NUCLEO_G071RB.upload.maximum_size=131072
# Nucleo_64.menu.pnum.NUCLEO_G071RB.upload.maximum_data_size=32768
# Nucleo_64.menu.pnum.NUCLEO_G071RB.build.mcu=cortex-m0plus
# Nucleo_64.menu.pnum.NUCLEO_G071RB.build.board=NUCLEO_G071RB
# Nucleo_64.menu.pnum.NUCLEO_G071RB.build.series=STM32G0xx
# Nucleo_64.menu.pnum.NUCLEO_G071RB.build.product_line=STM32G071xx
# Nucleo_64.menu.pnum.NUCLEO_G071RB.build.variant=NUCLEO_G071RB
# Nucleo_64.menu.pnum.NUCLEO_G071RB.build.cmsis_lib_gcc=arm_cortexM0l_math
# Nucleo_64.menu.pnum.NUCLEO_G071RB.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
# 
# # NUCLEO_G431RB board
# Nucleo_64.menu.pnum.NUCLEO_G431RB=Nucleo G431RB
# Nucleo_64.menu.pnum.NUCLEO_G431RB.node="NODE_G431RB,NOD_G431RB"
# Nucleo_64.menu.pnum.NUCLEO_G431RB.upload.maximum_size=131072
# Nucleo_64.menu.pnum.NUCLEO_G431RB.upload.maximum_data_size=32768
# Nucleo_64.menu.pnum.NUCLEO_G431RB.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_G431RB.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_G431RB.build.board=NUCLEO_G431RB
# Nucleo_64.menu.pnum.NUCLEO_G431RB.build.series=STM32G4xx
# Nucleo_64.menu.pnum.NUCLEO_G431RB.build.product_line=STM32G431xx
# Nucleo_64.menu.pnum.NUCLEO_G431RB.build.variant=NUCLEO_G431RB
