Omniment-public/RECore-Arduino_Core_STM32_old/boards.txt
# Nucleo_64.menu.pnum.NUCLEO_G431RB.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_G474RE board
# Nucleo_64.menu.pnum.NUCLEO_G474RE=Nucleo G474RE
# Nucleo_64.menu.pnum.NUCLEO_G474RE.node=NODE_G474RE
# Nucleo_64.menu.pnum.NUCLEO_G474RE.upload.maximum_size=524288
# Nucleo_64.menu.pnum.NUCLEO_G474RE.upload.maximum_data_size=131072
# Nucleo_64.menu.pnum.NUCLEO_G474RE.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_G474RE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_G474RE.build.board=NUCLEO_G474RE
# Nucleo_64.menu.pnum.NUCLEO_G474RE.build.series=STM32G4xx
# Nucleo_64.menu.pnum.NUCLEO_G474RE.build.product_line=STM32G474xx
# Nucleo_64.menu.pnum.NUCLEO_G474RE.build.variant=NUCLEO_G474RE
# Nucleo_64.menu.pnum.NUCLEO_G474RE.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_L053R8 board
# Nucleo_64.menu.pnum.NUCLEO_L053R8=Nucleo L053R8
# Nucleo_64.menu.pnum.NUCLEO_L053R8.node=NODE_L053R8
# Nucleo_64.menu.pnum.NUCLEO_L053R8.upload.maximum_size=65536
# Nucleo_64.menu.pnum.NUCLEO_L053R8.upload.maximum_data_size=8192
# Nucleo_64.menu.pnum.NUCLEO_L053R8.build.mcu=cortex-m0plus
# Nucleo_64.menu.pnum.NUCLEO_L053R8.build.board=NUCLEO_L053R8
# Nucleo_64.menu.pnum.NUCLEO_L053R8.build.series=STM32L0xx
# Nucleo_64.menu.pnum.NUCLEO_L053R8.build.product_line=STM32L053xx
# Nucleo_64.menu.pnum.NUCLEO_L053R8.build.variant=NUCLEO_L053R8
# Nucleo_64.menu.pnum.NUCLEO_L053R8.build.cmsis_lib_gcc=arm_cortexM0l_math
# Nucleo_64.menu.pnum.NUCLEO_L053R8.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
# 
# # NUCLEO_L073RZ board
# Nucleo_64.menu.pnum.NUCLEO_L073RZ=Nucleo L073RZ
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.node=NODE_L073RZ
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.upload.maximum_size=196608
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.upload.maximum_data_size=20480
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.build.mcu=cortex-m0plus
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.build.board=NUCLEO_L073RZ
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.build.series=STM32L0xx
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.build.product_line=STM32L073xx
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.build.variant=NUCLEO_L073RZ
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.build.cmsis_lib_gcc=arm_cortexM0l_math
# Nucleo_64.menu.pnum.NUCLEO_L073RZ.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
# 
# # NUCLEO_L152RE board
# Nucleo_64.menu.pnum.NUCLEO_L152RE=Nucleo L152RE
# Nucleo_64.menu.pnum.NUCLEO_L152RE.node="NODE_L152RE,NUCLEO"
# Nucleo_64.menu.pnum.NUCLEO_L152RE.upload.maximum_size=524288
# Nucleo_64.menu.pnum.NUCLEO_L152RE.upload.maximum_data_size=81920
# Nucleo_64.menu.pnum.NUCLEO_L152RE.build.mcu=cortex-m3
# Nucleo_64.menu.pnum.NUCLEO_L152RE.build.board=NUCLEO_L152RE
# Nucleo_64.menu.pnum.NUCLEO_L152RE.build.series=STM32L1xx
# Nucleo_64.menu.pnum.NUCLEO_L152RE.build.product_line=STM32L152xE
# Nucleo_64.menu.pnum.NUCLEO_L152RE.build.variant=NUCLEO_L152RE
# Nucleo_64.menu.pnum.NUCLEO_L152RE.build.cmsis_lib_gcc=arm_cortexM3l_math
# 
# # NUCLEO_L433RC_P board
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P=Nucleo L433RC-P
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.node=NODE_L433RC
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.upload.maximum_size=1048576
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.upload.maximum_data_size=98304
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.build.board=NUCLEO_L433RC
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.build.series=STM32L4xx
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.build.product_line=STM32L433xx
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.build.variant=NUCLEO_L433RC_P
# Nucleo_64.menu.pnum.NUCLEO_L433RC_P.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_L452RE board
# Nucleo_64.menu.pnum.NUCLEO_L452RE=Nucleo L452RE
# Nucleo_64.menu.pnum.NUCLEO_L452RE.node=NODE_L452RE
# Nucleo_64.menu.pnum.NUCLEO_L452RE.upload.maximum_size=524288
# Nucleo_64.menu.pnum.NUCLEO_L452RE.upload.maximum_data_size=163840
# Nucleo_64.menu.pnum.NUCLEO_L452RE.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_L452RE.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_L452RE.build.board=NUCLEO_L452RE
# Nucleo_64.menu.pnum.NUCLEO_L452RE.build.series=STM32L4xx
# Nucleo_64.menu.pnum.NUCLEO_L452RE.build.product_line=STM32L452xx
# Nucleo_64.menu.pnum.NUCLEO_L452RE.build.variant=NUCLEO_L452RE
# Nucleo_64.menu.pnum.NUCLEO_L452RE.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_L452RE-P board
# Nucleo_64.menu.pnum.NUCLEO_L452REP=Nucleo L452RE-P
# Nucleo_64.menu.pnum.NUCLEO_L452REP.node=NODE_L452RE
# Nucleo_64.menu.pnum.NUCLEO_L452REP.upload.maximum_size=524288
# Nucleo_64.menu.pnum.NUCLEO_L452REP.upload.maximum_data_size=163840
# Nucleo_64.menu.pnum.NUCLEO_L452REP.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_L452REP.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_L452REP.build.board=NUCLEO_L452RE_P
# Nucleo_64.menu.pnum.NUCLEO_L452REP.build.series=STM32L4xx
# Nucleo_64.menu.pnum.NUCLEO_L452REP.build.product_line=STM32L452xx
# Nucleo_64.menu.pnum.NUCLEO_L452REP.build.variant=NUCLEO_L452RE
# Nucleo_64.menu.pnum.NUCLEO_L452REP.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_L476RG board
# # Support: Serial1 (USART1 on PA10, PA9)
# Nucleo_64.menu.pnum.NUCLEO_L476RG=Nucleo L476RG
# Nucleo_64.menu.pnum.NUCLEO_L476RG.node=NODE_L476RG
# Nucleo_64.menu.pnum.NUCLEO_L476RG.upload.maximum_size=1048576
# Nucleo_64.menu.pnum.NUCLEO_L476RG.upload.maximum_data_size=98304
# Nucleo_64.menu.pnum.NUCLEO_L476RG.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.NUCLEO_L476RG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.NUCLEO_L476RG.build.board=NUCLEO_L476RG
# Nucleo_64.menu.pnum.NUCLEO_L476RG.build.series=STM32L4xx
# Nucleo_64.menu.pnum.NUCLEO_L476RG.build.product_line=STM32L476xx
# Nucleo_64.menu.pnum.NUCLEO_L476RG.build.variant=NUCLEO_L476RG
# Nucleo_64.menu.pnum.NUCLEO_L476RG.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # PNUCLEO_WB55RG board
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG=P-Nucleo WB55RG
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.node="NODE_WB55RG,NOD_WB55RG"
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.upload.maximum_size=524288
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.upload.maximum_data_size=196604
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.build.mcu=cortex-m4
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.build.board=PNUCLEO_WB55RG
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.build.series=STM32WBxx
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.build.product_line=STM32WB55xx
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.build.variant=PNUCLEO_WB55RG
# Nucleo_64.menu.pnum.PNUCLEO_WB55RG.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # Upload menu
# Nucleo_64.menu.upload_method.MassStorage=Mass Storage
# Nucleo_64.menu.upload_method.MassStorage.upload.protocol=
# Nucleo_64.menu.upload_method.MassStorage.upload.tool=massStorageCopy
# 
# Nucleo_64.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# Nucleo_64.menu.upload_method.swdMethod.upload.protocol=0
# Nucleo_64.menu.upload_method.swdMethod.upload.options=-g
# Nucleo_64.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# Nucleo_64.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# Nucleo_64.menu.upload_method.serialMethod.upload.protocol=1
# Nucleo_64.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# Nucleo_64.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# Nucleo_64.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# Nucleo_64.menu.upload_method.dfuMethod.upload.protocol=2
# Nucleo_64.menu.upload_method.dfuMethod.upload.options=-g
# Nucleo_64.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# ################################################################################
# # Nucleo 32 boards
# 
# Nucleo_32.name=Nucleo-32
# 
# Nucleo_32.build.core=arduino
# Nucleo_32.build.board=Nucleo_32
# Nucleo_32.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
# 
# # NUCLEO_F031K6 board
# Nucleo_32.menu.pnum.NUCLEO_F031K6=Nucleo F031K6
# Nucleo_32.menu.pnum.NUCLEO_F031K6.node=NODE_F031K6
# Nucleo_32.menu.pnum.NUCLEO_F031K6.upload.maximum_size=32768
# Nucleo_32.menu.pnum.NUCLEO_F031K6.upload.maximum_data_size=4096
# Nucleo_32.menu.pnum.NUCLEO_F031K6.build.mcu=cortex-m0
# Nucleo_32.menu.pnum.NUCLEO_F031K6.build.board=NUCLEO_F031K6
# Nucleo_32.menu.pnum.NUCLEO_F031K6.build.series=STM32F0xx
# Nucleo_32.menu.pnum.NUCLEO_F031K6.build.product_line=STM32F031x6
# Nucleo_32.menu.pnum.NUCLEO_F031K6.build.variant=NUCLEO_F031K6
# Nucleo_32.menu.pnum.NUCLEO_F031K6.build.cmsis_lib_gcc=arm_cortexM0l_math
# 
# # NUCLEO_L031K6 board
# Nucleo_32.menu.pnum.NUCLEO_L031K6=Nucleo L031K6
# Nucleo_32.menu.pnum.NUCLEO_L031K6.node=NODE_L031K6
# Nucleo_32.menu.pnum.NUCLEO_L031K6.upload.maximum_size=32768
# Nucleo_32.menu.pnum.NUCLEO_L031K6.upload.maximum_data_size=8192
# Nucleo_32.menu.pnum.NUCLEO_L031K6.build.mcu=cortex-m0plus
# Nucleo_32.menu.pnum.NUCLEO_L031K6.build.board=NUCLEO_L031K6
# Nucleo_32.menu.pnum.NUCLEO_L031K6.build.series=STM32L0xx
# Nucleo_32.menu.pnum.NUCLEO_L031K6.build.product_line=STM32L031xx
# Nucleo_32.menu.pnum.NUCLEO_L031K6.build.variant=NUCLEO_L031K6
# Nucleo_32.menu.pnum.NUCLEO_L031K6.build.cmsis_lib_gcc=arm_cortexM0l_math
# 
# # NUCLEO_L412KB board
# Nucleo_32.menu.pnum.NUCLEO_L412KB=Nucleo L412KB
# Nucleo_32.menu.pnum.NUCLEO_L412KB.node=NODE_L412KB
# Nucleo_32.menu.pnum.NUCLEO_L412KB.upload.maximum_size=131072
# Nucleo_32.menu.pnum.NUCLEO_L412KB.upload.maximum_data_size=40960
# Nucleo_32.menu.pnum.NUCLEO_L412KB.build.mcu=cortex-m4
# Nucleo_32.menu.pnum.NUCLEO_L412KB.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_32.menu.pnum.NUCLEO_L412KB.build.board=NUCLEO_L412KB
# Nucleo_32.menu.pnum.NUCLEO_L412KB.build.series=STM32L4xx
# Nucleo_32.menu.pnum.NUCLEO_L412KB.build.product_line=STM32L412xx
# Nucleo_32.menu.pnum.NUCLEO_L412KB.build.variant=NUCLEO_L412KB
# Nucleo_32.menu.pnum.NUCLEO_L412KB.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_L432KC board
# Nucleo_32.menu.pnum.NUCLEO_L432KC=Nucleo L432KC
# Nucleo_32.menu.pnum.NUCLEO_L432KC.node=NODE_L432KC
# Nucleo_32.menu.pnum.NUCLEO_L432KC.upload.maximum_size=262144
# Nucleo_32.menu.pnum.NUCLEO_L432KC.upload.maximum_data_size=65536
# Nucleo_32.menu.pnum.NUCLEO_L432KC.build.mcu=cortex-m4
# Nucleo_32.menu.pnum.NUCLEO_L432KC.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_32.menu.pnum.NUCLEO_L432KC.build.board=NUCLEO_L432KC
# Nucleo_32.menu.pnum.NUCLEO_L432KC.build.series=STM32L4xx
# Nucleo_32.menu.pnum.NUCLEO_L432KC.build.product_line=STM32L432xx
# Nucleo_32.menu.pnum.NUCLEO_L432KC.build.variant=NUCLEO_L432KC
# Nucleo_32.menu.pnum.NUCLEO_L432KC.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_F303K8 board
# Nucleo_32.menu.pnum.NUCLEO_F303K8=Nucleo F303K8
# Nucleo_32.menu.pnum.NUCLEO_F303K8.node=NODE_F303K8
# Nucleo_32.menu.pnum.NUCLEO_F303K8.upload.maximum_size=65536
# Nucleo_32.menu.pnum.NUCLEO_F303K8.upload.maximum_data_size=12288
# Nucleo_32.menu.pnum.NUCLEO_F303K8.build.mcu=cortex-m4
# Nucleo_32.menu.pnum.NUCLEO_F303K8.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_32.menu.pnum.NUCLEO_F303K8.build.board=NUCLEO_F303K8
# Nucleo_32.menu.pnum.NUCLEO_F303K8.build.series=STM32F3xx
# Nucleo_32.menu.pnum.NUCLEO_F303K8.build.product_line=STM32F303x8
# Nucleo_32.menu.pnum.NUCLEO_F303K8.build.variant=NUCLEO_F303K8
# Nucleo_32.menu.pnum.NUCLEO_F303K8.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # NUCLEO_G431KB board
# Nucleo_32.menu.pnum.NUCLEO_G431KB=Nucleo G431KB
# Nucleo_32.menu.pnum.NUCLEO_G431KB.node="NODE_G431KB,NOD_G431KB"
# Nucleo_32.menu.pnum.NUCLEO_G431KB.upload.maximum_size=131072
# Nucleo_32.menu.pnum.NUCLEO_G431KB.upload.maximum_data_size=32768
# Nucleo_32.menu.pnum.NUCLEO_G431KB.build.mcu=cortex-m4
# Nucleo_32.menu.pnum.NUCLEO_G431KB.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Nucleo_32.menu.pnum.NUCLEO_G431KB.build.board=NUCLEO_G431KB
# Nucleo_32.menu.pnum.NUCLEO_G431KB.build.series=STM32G4xx
# Nucleo_32.menu.pnum.NUCLEO_G431KB.build.product_line=STM32G431xx
# Nucleo_32.menu.pnum.NUCLEO_G431KB.build.variant=NUCLEO_G431KB
# Nucleo_32.menu.pnum.NUCLEO_G431KB.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # Upload menu
# Nucleo_32.menu.upload_method.MassStorage=Mass Storage
# Nucleo_32.menu.upload_method.MassStorage.upload.protocol=
# Nucleo_32.menu.upload_method.MassStorage.upload.tool=massStorageCopy
# 
# Nucleo_32.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# Nucleo_32.menu.upload_method.swdMethod.upload.protocol=0
# Nucleo_32.menu.upload_method.swdMethod.upload.options=-g
# Nucleo_32.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# Nucleo_32.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# Nucleo_32.menu.upload_method.serialMethod.upload.protocol=1
# Nucleo_32.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# Nucleo_32.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# Nucleo_32.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# Nucleo_32.menu.upload_method.dfuMethod.upload.protocol=2
# Nucleo_32.menu.upload_method.dfuMethod.upload.options=-g
# Nucleo_32.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# ################################################################################
# # Discovery boards
# 
# Disco.name=Discovery
# 
# Disco.build.core=arduino
# Disco.build.board=Disco
# Disco.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
# 
# # DISCO_F030R8 board
# Disco.menu.pnum.DISCO_F030R8=STM32F030R8-DISCVL
# Disco.menu.pnum.DISCO_F030R8.node="No_mass_storage_for_this_board_Use_STLink_upload_method"
# Disco.menu.pnum.DISCO_F030R8.upload.maximum_size=65536
# Disco.menu.pnum.DISCO_F030R8.upload.maximum_data_size=8192
# Disco.menu.pnum.DISCO_F030R8.build.mcu=cortex-m0
# Disco.menu.pnum.DISCO_F030R8.build.board=DISCO_F030R8
# Disco.menu.pnum.DISCO_F030R8.build.series=STM32F0xx
# Disco.menu.pnum.DISCO_F030R8.build.product_line=STM32F030x8
# Disco.menu.pnum.DISCO_F030R8.build.variant=DISCO_F030R8
# Disco.menu.pnum.DISCO_F030R8.build.cmsis_lib_gcc=arm_cortexM0l_math
# 
# # DISCO_F072RB board
# Disco.menu.pnum.DISCO_F072RB=STM32F072B-DISCOVERY
# Disco.menu.pnum.DISCO_F072RB.node="No_mass_storage_for_this_board_Use_STLink_upload_method"
# Disco.menu.pnum.DISCO_F072RB.upload.maximum_size=131072
# Disco.menu.pnum.DISCO_F072RB.upload.maximum_data_size=16384
# Disco.menu.pnum.DISCO_F072RB.build.mcu=cortex-m0
# Disco.menu.pnum.DISCO_F072RB.build.board=DISCO_F072RB
# Disco.menu.pnum.DISCO_F072RB.build.series=STM32F0xx
# Disco.menu.pnum.DISCO_F072RB.build.product_line=STM32F072xB
# Disco.menu.pnum.DISCO_F072RB.build.variant=DISCO_F072RB
# Disco.menu.pnum.DISCO_F072RB.build.cmsis_lib_gcc=arm_cortexM0l_math
# 
# #DISCO_F100RB board
# Disco.menu.pnum.DISCO_F100RB=STM32F100RB-DISCVL
# Disco.menu.pnum.DISCO_F100RB.node=DIS_F100RB
# Disco.menu.pnum.DISCO_F100RB.upload.maximum_size=131071
# Disco.menu.pnum.DISCO_F100RB.upload.maximum_data_size=8192
# Disco.menu.pnum.DISCO_F100RB.build.mcu=cortex-m3
# Disco.menu.pnum.DISCO_F100RB.build.board=DISCO_F100RB
# Disco.menu.pnum.DISCO_F100RB.build.series=STM32F1xx
# Disco.menu.pnum.DISCO_F100RB.build.product_line=STM32F100xB
# Disco.menu.pnum.DISCO_F100RB.build.variant=DISCO_F100RB
# Disco.menu.pnum.DISCO_F100RB.build.cmsis_lib_gcc=arm_cortexM3l_math
# 
# # DISCO_F407VG board
# Disco.menu.pnum.DISCO_F407VG=STM32F407G-DISC1
# Disco.menu.pnum.DISCO_F407VG.node=DIS_F407VG
# Disco.menu.pnum.DISCO_F407VG.upload.maximum_size=1048576
# Disco.menu.pnum.DISCO_F407VG.upload.maximum_data_size=131072
# Disco.menu.pnum.DISCO_F407VG.build.mcu=cortex-m4
# Disco.menu.pnum.DISCO_F407VG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Disco.menu.pnum.DISCO_F407VG.build.board=DISCO_F407VG
# Disco.menu.pnum.DISCO_F407VG.build.series=STM32F4xx
# Disco.menu.pnum.DISCO_F407VG.build.product_line=STM32F407xx
# Disco.menu.pnum.DISCO_F407VG.build.variant=DISCO_F407VG
# Disco.menu.pnum.DISCO_F407VG.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # DISCO_F413ZH board
# Disco.menu.pnum.DISCO_F413ZH=STM32F413H-DISCO
# Disco.menu.pnum.DISCO_F413ZH.node=DIS_F413ZH
# Disco.menu.pnum.DISCO_F413ZH.upload.maximum_size=1572864
# Disco.menu.pnum.DISCO_F413ZH.upload.maximum_data_size=327680
# Disco.menu.pnum.DISCO_F413ZH.build.mcu=cortex-m4
# Disco.menu.pnum.DISCO_F413ZH.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Disco.menu.pnum.DISCO_F413ZH.build.board=DISCO_F413ZH
# Disco.menu.pnum.DISCO_F413ZH.build.series=STM32F4xx
# Disco.menu.pnum.DISCO_F413ZH.build.product_line=STM32F413xx
# Disco.menu.pnum.DISCO_F413ZH.build.variant=DISCO_F413ZH
# Disco.menu.pnum.DISCO_F413ZH.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # DISCO_F746NG board
# Disco.menu.pnum.DISCO_F746NG=STM32F746G-DISCOVERY
# Disco.menu.pnum.DISCO_F746NG.node=DIS_F746NG
# Disco.menu.pnum.DISCO_F746NG.upload.maximum_size=1048576
# Disco.menu.pnum.DISCO_F746NG.upload.maximum_data_size=327680
# Disco.menu.pnum.DISCO_F746NG.build.mcu=cortex-m7
# Disco.menu.pnum.DISCO_F746NG.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Disco.menu.pnum.DISCO_F746NG.build.board=DISCO_F746NG
# Disco.menu.pnum.DISCO_F746NG.build.series=STM32F7xx
# Disco.menu.pnum.DISCO_F746NG.build.product_line=STM32F746xx
# Disco.menu.pnum.DISCO_F746NG.build.variant=DISCO_F746NG
# Disco.menu.pnum.DISCO_F746NG.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
# 
# # DISCO_G0316 board
# Disco.menu.pnum.DISCO_G0316=STM32G0316-DISCO
# Disco.menu.pnum.DISCO_G0316.node=NODE_G031J6
# Disco.menu.pnum.DISCO_G0316.upload.maximum_size=131072
# Disco.menu.pnum.DISCO_G0316.upload.maximum_data_size=32768
# Disco.menu.pnum.DISCO_G0316.build.mcu=cortex-m0plus
# Disco.menu.pnum.DISCO_G0316.build.board=DISCO_G0316
# Disco.menu.pnum.DISCO_G0316.build.series=STM32G0xx
# Disco.menu.pnum.DISCO_G0316.build.product_line=STM32G031xx
# Disco.menu.pnum.DISCO_G0316.build.variant=DISCO_G0316
