Omniment-public/RECore-Arduino_Core_STM32_old/boards.txt
# Disco.menu.pnum.DISCO_G0316.build.cmsis_lib_gcc=arm_cortexM0l_math
# Disco.menu.pnum.DISCO_G0316.build.extra_flags=-D{build.product_line} {build.xSerial} -D__CORTEX_SC=0
# 
# # DISCO_L475VG_IOT board
# Disco.menu.pnum.DISCO_L475VG_IOT=STM32L475VG-DISCOVERY-IOT
# Disco.menu.pnum.DISCO_L475VG_IOT.node=DIS_L4IOT
# Disco.menu.pnum.DISCO_L475VG_IOT.upload.maximum_size=1048576
# Disco.menu.pnum.DISCO_L475VG_IOT.upload.maximum_data_size=98304
# Disco.menu.pnum.DISCO_L475VG_IOT.build.mcu=cortex-m4
# Disco.menu.pnum.DISCO_L475VG_IOT.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Disco.menu.pnum.DISCO_L475VG_IOT.build.board=DISCO_L475VG_IOT
# Disco.menu.pnum.DISCO_L475VG_IOT.build.series=STM32L4xx
# Disco.menu.pnum.DISCO_L475VG_IOT.build.product_line=STM32L475xx
# Disco.menu.pnum.DISCO_L475VG_IOT.build.variant=DISCO_L475VG_IOT
# Disco.menu.pnum.DISCO_L475VG_IOT.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # B_L4S5I_IOT01A board
# Disco.menu.pnum.B_L4S5I_IOT01A=B-L4S5I-IOT01A
# Disco.menu.pnum.B_L4S5I_IOT01A.node="DIS_L4IOT,DIS_L4S5VI"
# Disco.menu.pnum.B_L4S5I_IOT01A.upload.maximum_size=2097152
# Disco.menu.pnum.B_L4S5I_IOT01A.upload.maximum_data_size=655360
# Disco.menu.pnum.B_L4S5I_IOT01A.build.mcu=cortex-m4
# Disco.menu.pnum.B_L4S5I_IOT01A.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Disco.menu.pnum.B_L4S5I_IOT01A.build.board=B_L4S5I_IOT01A
# Disco.menu.pnum.B_L4S5I_IOT01A.build.series=STM32L4xx
# Disco.menu.pnum.B_L4S5I_IOT01A.build.product_line=STM32L4S5xx
# Disco.menu.pnum.B_L4S5I_IOT01A.build.variant=B_L4S5I_IOT01A
# Disco.menu.pnum.B_L4S5I_IOT01A.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # DISCO-L072CZ-LRWAN1 board
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1=Discovery L072CZ-LRWAN1
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.node="DIS_L072Z,NODE_L072CZ"
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.upload.maximum_size=196608
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.upload.maximum_data_size=20480
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.mcu=cortex-m0plus
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.board=DISCO_L072CZ_LRWAN1
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.series=STM32L0xx
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.product_line=STM32L072xx
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.variant=DISCO_L072CZ_LRWAN1
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.cmsis_lib_gcc=arm_cortexM0l_math
# Disco.menu.pnum.DISCO_L072CZ_LRWAN1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
# 
# # Upload menu
# Disco.menu.upload_method.MassStorage=Mass Storage
# Disco.menu.upload_method.MassStorage.upload.protocol=
# Disco.menu.upload_method.MassStorage.upload.tool=massStorageCopy
# 
# Disco.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# Disco.menu.upload_method.swdMethod.upload.protocol=0
# Disco.menu.upload_method.swdMethod.upload.options=-g
# Disco.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# Disco.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# Disco.menu.upload_method.serialMethod.upload.protocol=1
# Disco.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# Disco.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# Disco.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# Disco.menu.upload_method.dfuMethod.upload.protocol=2
# Disco.menu.upload_method.dfuMethod.upload.options=-g
# Disco.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# ################################################################################
# # Eval boards
# 
# Eval.name=Eval
# 
# Eval.build.core=arduino
# Eval.build.board=Eval
# Eval.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
# 
# # STEVAL_MKSBOX1V1 board
# Eval.menu.pnum.STEVAL_MKSBOX1V1=SensorTile.box
# Eval.menu.pnum.STEVAL_MKSBOX1V1.upload.maximum_size=2097152
# Eval.menu.pnum.STEVAL_MKSBOX1V1.upload.maximum_data_size=655360
# Eval.menu.pnum.STEVAL_MKSBOX1V1.build.mcu=cortex-m4
# Eval.menu.pnum.STEVAL_MKSBOX1V1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# Eval.menu.pnum.STEVAL_MKSBOX1V1.build.board=STEVAL_MKSBOX1V1
# Eval.menu.pnum.STEVAL_MKSBOX1V1.build.series=STM32L4xx
# Eval.menu.pnum.STEVAL_MKSBOX1V1.build.product_line=STM32L4R9xx
# Eval.menu.pnum.STEVAL_MKSBOX1V1.build.variant=STEVAL_MKSBOX1V1
# Eval.menu.pnum.STEVAL_MKSBOX1V1.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # Upload menu
# Eval.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# Eval.menu.upload_method.swdMethod.upload.protocol=0
# Eval.menu.upload_method.swdMethod.upload.options=-g
# Eval.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# Eval.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# Eval.menu.upload_method.dfuMethod.upload.protocol=2
# Eval.menu.upload_method.dfuMethod.upload.options=-g
# Eval.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# ################################################################################
# # STM32MP1 microprocessor series (MPU + MCU)
# 
# STM32MP1.name=STM32MP1 series coprocessor
# 
# STM32MP1.build.core=arduino
# STM32MP1.build.board=STM32MP1
# STM32MP1.build.mcu=cortex-m4
# STM32MP1.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# STM32MP1.build.series=STM32MP1xx
# STM32MP1.build.cmsis_lib_gcc=arm_cortexM4l_math
# STM32MP1.build.extra_flags=-DCORE_CM4 -DUSE_FULL_LL_DRIVER -D{build.product_line} {build.enable_virtio} {build.xSerial}
# 
# # STM32MP157A-DK1 board
# STM32MP1.menu.pnum.STM32MP157A_DK1=STM32MP157A-DK1
# STM32MP1.menu.pnum.STM32MP157A_DK1.upload.maximum_size=131072
# STM32MP1.menu.pnum.STM32MP157A_DK1.upload.maximum_data_size=131072
# STM32MP1.menu.pnum.STM32MP157A_DK1.build.board=STM32MP157A_DK1
# STM32MP1.menu.pnum.STM32MP157A_DK1.build.product_line=STM32MP157Axx
# STM32MP1.menu.pnum.STM32MP157A_DK1.build.variant=STM32MP157_DK
# 
# # STM32MP157C-DK2 board
# STM32MP1.menu.pnum.STM32MP157C_DK2=STM32MP157C-DK2
# STM32MP1.menu.pnum.STM32MP157C_DK2.upload.maximum_size=131072
# STM32MP1.menu.pnum.STM32MP157C_DK2.upload.maximum_data_size=131072
# STM32MP1.menu.pnum.STM32MP157C_DK2.build.board=STM32MP157C_DK2
# STM32MP1.menu.pnum.STM32MP157C_DK2.build.product_line=STM32MP157Cxx
# STM32MP1.menu.pnum.STM32MP157C_DK2.build.variant=STM32MP157_DK
# 
# # Upload menu
# STM32MP1.menu.upload_method.MassStorage=Generate run_arduino.sh (You need to copy this manually)
# STM32MP1.menu.upload_method.MassStorage.upload.protocol=
# STM32MP1.menu.upload_method.MassStorage.upload.tool=remoteproc_gen
# 
# ################################################################################
# # Other boards
# 
# ###############################
# # Generic F0
# GenF0.name=Generic STM32F0 series
# 
# GenF0.build.core=arduino
# GenF0.build.board=GenF0
# GenF0.build.mcu=cortex-m0
# GenF0.build.series=STM32F0xx
# GenF0.build.cmsis_lib_gcc=arm_cortexM0l_math
# GenF0.build.extra_flags=-D{build.product_line} {build.xSerial}
# 
# # DEMO_F030F4 board
# GenF0.menu.pnum.DEMO_F030F4=STM32F030F4 Demo board
# GenF0.menu.pnum.DEMO_F030F4.upload.maximum_data_size=4096
# GenF0.menu.pnum.DEMO_F030F4.upload.maximum_size=16384
# GenF0.menu.pnum.DEMO_F030F4.build.board=DEMO_F030F4
# GenF0.menu.pnum.DEMO_F030F4.build.product_line=STM32F030x6
# GenF0.menu.pnum.DEMO_F030F4.build.variant=DEMO_F030F4
# 
# # DEMO_F030F4_16M board
# GenF0.menu.pnum.DEMO_F030F4_16M=STM32F030F4 Demo board (16Mhz)
# GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_data_size=4096
# GenF0.menu.pnum.DEMO_F030F4_16M.upload.maximum_size=16384
# GenF0.menu.pnum.DEMO_F030F4_16M.build.board=DEMO_F030F4_16M
# GenF0.menu.pnum.DEMO_F030F4_16M.build.product_line=STM32F030x6
# GenF0.menu.pnum.DEMO_F030F4_16M.build.variant=DEMO_F030F4
# 
# # DEMO_F030F4_HSI board
# GenF0.menu.pnum.DEMO_F030F4_HSI=STM32F030F4 Demo board (internal RC oscillator)
# GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_data_size=4096
# GenF0.menu.pnum.DEMO_F030F4_HSI.upload.maximum_size=16384
# GenF0.menu.pnum.DEMO_F030F4_HSI.build.board=DEMO_F030F4_HSI
# GenF0.menu.pnum.DEMO_F030F4_HSI.build.product_line=STM32F030x6
# GenF0.menu.pnum.DEMO_F030F4_HSI.build.variant=DEMO_F030F4
# 
# # Upload menu
# GenF0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# GenF0.menu.upload_method.swdMethod.upload.protocol=0
# GenF0.menu.upload_method.swdMethod.upload.options=-g
# GenF0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# GenF0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# GenF0.menu.upload_method.serialMethod.upload.protocol=1
# GenF0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# GenF0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# GenF0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# GenF0.menu.upload_method.dfuMethod.upload.protocol=2
# GenF0.menu.upload_method.dfuMethod.upload.options=-g
# GenF0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# ################################################################################
# # Generic F1
# GenF1.name=Generic STM32F1 series
# 
# GenF1.build.core=arduino
# GenF1.build.board=GenF1
# GenF1.build.mcu=cortex-m3
# GenF1.build.series=STM32F1xx
# GenF1.build.cmsis_lib_gcc=arm_cortexM3l_math
# GenF1.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
# 
# # BLUEPILL_F103C6 board
# GenF1.menu.pnum.BLUEPILL_F103C6=BluePill F103C6 (32K)
# GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_size=32768
# GenF1.menu.pnum.BLUEPILL_F103C6.upload.maximum_data_size=10240
# GenF1.menu.pnum.BLUEPILL_F103C6.build.board=BLUEPILL_F103C6
# GenF1.menu.pnum.BLUEPILL_F103C6.build.product_line=STM32F103x6
# GenF1.menu.pnum.BLUEPILL_F103C6.build.variant=PILL_F103XX
# 
# # BLUEPILL_F103C8 board
# GenF1.menu.pnum.BLUEPILL_F103C8=BluePill F103C8
# GenF1.menu.pnum.BLUEPILL_F103C8.upload.maximum_size=65536
# GenF1.menu.pnum.BLUEPILL_F103C8.upload.maximum_data_size=20480
# GenF1.menu.pnum.BLUEPILL_F103C8.build.board=BLUEPILL_F103C8
# GenF1.menu.pnum.BLUEPILL_F103C8.build.product_line=STM32F103xB
# GenF1.menu.pnum.BLUEPILL_F103C8.build.variant=PILL_F103XX
# 
# GenF1.menu.pnum.BLUEPILL_F103CB=BluePill F103CB (or C8 with 128k)
# GenF1.menu.pnum.BLUEPILL_F103CB.upload.maximum_size=131072
# GenF1.menu.pnum.BLUEPILL_F103CB.upload.maximum_data_size=20480
# GenF1.menu.pnum.BLUEPILL_F103CB.build.board=BLUEPILL_F103CB
# GenF1.menu.pnum.BLUEPILL_F103CB.build.product_line=STM32F103xB
# GenF1.menu.pnum.BLUEPILL_F103CB.build.variant=PILL_F103XX
# 
# # BLACKPILL_F103C8 board
# GenF1.menu.pnum.BLACKPILL_F103C8=BlackPill F103C8
# GenF1.menu.pnum.BLACKPILL_F103C8.upload.maximum_size=65536
# GenF1.menu.pnum.BLACKPILL_F103C8.upload.maximum_data_size=20480
# GenF1.menu.pnum.BLACKPILL_F103C8.build.board=BLACKPILL_F103C8
# GenF1.menu.pnum.BLACKPILL_F103C8.build.product_line=STM32F103xB
# GenF1.menu.pnum.BLACKPILL_F103C8.build.variant=PILL_F103XX
# 
# GenF1.menu.pnum.BLACKPILL_F103CB=BlackPill F103CB (or C8 with 128k)
# GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_size=131072
# GenF1.menu.pnum.BLACKPILL_F103CB.upload.maximum_data_size=20480
# GenF1.menu.pnum.BLACKPILL_F103CB.build.board=BLACKPILL_F103CB
# GenF1.menu.pnum.BLACKPILL_F103CB.build.product_line=STM32F103xB
# GenF1.menu.pnum.BLACKPILL_F103CB.build.variant=PILL_F103XX
# 
# # Generic STM32F103Cx boards
# GenF1.menu.pnum.Generic_F103C4=Generic F103C4
# GenF1.menu.pnum.Generic_F103C4.upload.maximum_size=16384
# GenF1.menu.pnum.Generic_F103C4.upload.maximum_data_size=6144
# GenF1.menu.pnum.Generic_F103C4.build.board=GENERIC_F103C4
# GenF1.menu.pnum.Generic_F103C4.build.product_line=STM32F103x6
# GenF1.menu.pnum.Generic_F103C4.build.variant=Generic_F103Cx
# 
# GenF1.menu.pnum.Generic_F103C6=Generic F103C6
# GenF1.menu.pnum.Generic_F103C6.upload.maximum_size=32768
# GenF1.menu.pnum.Generic_F103C6.upload.maximum_data_size=10240
# GenF1.menu.pnum.Generic_F103C6.build.board=GENERIC_F103C6
# GenF1.menu.pnum.Generic_F103C6.build.product_line=STM32F103x6
# GenF1.menu.pnum.Generic_F103C6.build.variant=Generic_F103Cx
# 
# GenF1.menu.pnum.Generic_F103C8=Generic F103C8
# GenF1.menu.pnum.Generic_F103C8.upload.maximum_size=65536
# GenF1.menu.pnum.Generic_F103C8.upload.maximum_data_size=20480
# GenF1.menu.pnum.Generic_F103C8.build.board=GENERIC_F103C8
# GenF1.menu.pnum.Generic_F103C8.build.product_line=STM32F103xB
# GenF1.menu.pnum.Generic_F103C8.build.variant=Generic_F103Cx
# 
# GenF1.menu.pnum.Generic_F103CB=Generic F103CB
# GenF1.menu.pnum.Generic_F103CB.upload.maximum_size=131072
# GenF1.menu.pnum.Generic_F103CB.upload.maximum_data_size=20480
# GenF1.menu.pnum.Generic_F103CB.build.board=GENERIC_F103CB
# GenF1.menu.pnum.Generic_F103CB.build.product_line=STM32F103xB
# GenF1.menu.pnum.Generic_F103CB.build.variant=Generic_F103Cx
# 
# # Generic STM32F103Rx boards
# GenF1.menu.pnum.Generic_F103R4=Generic F103R4
# GenF1.menu.pnum.Generic_F103R4.upload.maximum_size=16384
# GenF1.menu.pnum.Generic_F103R4.upload.maximum_data_size=6144
# GenF1.menu.pnum.Generic_F103R4.build.board=GENERIC_F103R4
# GenF1.menu.pnum.Generic_F103R4.build.product_line=STM32F103x6
# GenF1.menu.pnum.Generic_F103R4.build.variant=Generic_F103Rx
# 
# GenF1.menu.pnum.Generic_F103R6=Generic F103R6
# GenF1.menu.pnum.Generic_F103R6.upload.maximum_size=32768
# GenF1.menu.pnum.Generic_F103R6.upload.maximum_data_size=10240
# GenF1.menu.pnum.Generic_F103R6.build.board=GENERIC_F103R6
# GenF1.menu.pnum.Generic_F103R6.build.product_line=STM32F103x6
# GenF1.menu.pnum.Generic_F103R6.build.variant=Generic_F103Rx
# 
# GenF1.menu.pnum.Generic_F103R8=Generic F103R8
# GenF1.menu.pnum.Generic_F103R8.upload.maximum_size=65536
# GenF1.menu.pnum.Generic_F103R8.upload.maximum_data_size=20480
# GenF1.menu.pnum.Generic_F103R8.build.board=GENERIC_F103R8
# GenF1.menu.pnum.Generic_F103R8.build.product_line=STM32F103xB
# GenF1.menu.pnum.Generic_F103R8.build.variant=Generic_F103Rx
# 
# GenF1.menu.pnum.Generic_F103RB=Generic F103RB
# GenF1.menu.pnum.Generic_F103RB.upload.maximum_size=131072
# GenF1.menu.pnum.Generic_F103RB.upload.maximum_data_size=20480
# GenF1.menu.pnum.Generic_F103RB.build.board=GENERIC_F103RB
# GenF1.menu.pnum.Generic_F103RB.build.product_line=STM32F103xB
# GenF1.menu.pnum.Generic_F103RB.build.variant=Generic_F103Rx
# 
# GenF1.menu.pnum.Generic_F103RC=Generic F103RC
# GenF1.menu.pnum.Generic_F103RC.upload.maximum_size=262144
# GenF1.menu.pnum.Generic_F103RC.upload.maximum_data_size=49152
# GenF1.menu.pnum.Generic_F103RC.build.board=GENERIC_F103RC
# GenF1.menu.pnum.Generic_F103RC.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103RC.build.variant=Generic_F103Rx
# 
# GenF1.menu.pnum.Generic_F103RD=Generic F103RD
# GenF1.menu.pnum.Generic_F103RD.upload.maximum_size=393216
# GenF1.menu.pnum.Generic_F103RD.upload.maximum_data_size=65536
# GenF1.menu.pnum.Generic_F103RD.build.board=GENERIC_F103RD
# GenF1.menu.pnum.Generic_F103RD.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103RD.build.variant=Generic_F103Rx
# 
# GenF1.menu.pnum.Generic_F103RE=Generic F103RE
# GenF1.menu.pnum.Generic_F103RE.upload.maximum_size=524288
# GenF1.menu.pnum.Generic_F103RE.upload.maximum_data_size=65536
# GenF1.menu.pnum.Generic_F103RE.build.board=GENERIC_F103RE
# GenF1.menu.pnum.Generic_F103RE.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103RE.build.variant=Generic_F103Rx
# 
# GenF1.menu.pnum.Generic_F103RF=Generic F103RF
# GenF1.menu.pnum.Generic_F103RF.upload.maximum_size=786432
# GenF1.menu.pnum.Generic_F103RF.upload.maximum_data_size=98304
# GenF1.menu.pnum.Generic_F103RF.build.board=GENERIC_F103RF
# GenF1.menu.pnum.Generic_F103RF.build.product_line=STM32F103xG
# GenF1.menu.pnum.Generic_F103RF.build.variant=Generic_F103Rx
# 
# GenF1.menu.pnum.Generic_F103RG=Generic F103RG
# GenF1.menu.pnum.Generic_F103RG.upload.maximum_size=1048576
# GenF1.menu.pnum.Generic_F103RG.upload.maximum_data_size=98304
# GenF1.menu.pnum.Generic_F103RG.build.board=GENERIC_F103RG
# GenF1.menu.pnum.Generic_F103RG.build.product_line=STM32F103xG
# GenF1.menu.pnum.Generic_F103RG.build.variant=Generic_F103Rx
# 
# # Generic STM32F103Tx boards
# GenF1.menu.pnum.Generic_F103T4=Generic F103T4
# GenF1.menu.pnum.Generic_F103T4.upload.maximum_size=16384
# GenF1.menu.pnum.Generic_F103T4.upload.maximum_data_size=6144
# GenF1.menu.pnum.Generic_F103T4.build.board=GENERIC_F103T4
# GenF1.menu.pnum.Generic_F103T4.build.product_line=STM32F103x6
# GenF1.menu.pnum.Generic_F103T4.build.variant=Generic_F103Tx
# 
# GenF1.menu.pnum.Generic_F103T6=Generic F103T6
# GenF1.menu.pnum.Generic_F103T6.upload.maximum_size=32768
# GenF1.menu.pnum.Generic_F103T6.upload.maximum_data_size=10240
# GenF1.menu.pnum.Generic_F103T6.build.board=GENERIC_F103T6
# GenF1.menu.pnum.Generic_F103T6.build.product_line=STM32F103x6
# GenF1.menu.pnum.Generic_F103T6.build.variant=Generic_F103Tx
# 
# GenF1.menu.pnum.Generic_F103T8=Generic F103T8
# GenF1.menu.pnum.Generic_F103T8.upload.maximum_size=65536
# GenF1.menu.pnum.Generic_F103T8.upload.maximum_data_size=20480
# GenF1.menu.pnum.Generic_F103T8.build.board=GENERIC_F103T8
# GenF1.menu.pnum.Generic_F103T8.build.product_line=STM32F103xB
# GenF1.menu.pnum.Generic_F103T8.build.variant=Generic_F103Tx
# 
# GenF1.menu.pnum.Generic_F103TB=Generic F103TB
# GenF1.menu.pnum.Generic_F103TB.upload.maximum_size=131072
# GenF1.menu.pnum.Generic_F103TB.upload.maximum_data_size=20480
# GenF1.menu.pnum.Generic_F103TB.build.board=GENERIC_F103TB
# GenF1.menu.pnum.Generic_F103TB.build.product_line=STM32F103xB
# GenF1.menu.pnum.Generic_F103TB.build.variant=Generic_F103Tx
# 
# # Generic STM32F103Vx boards
# GenF1.menu.pnum.Generic_F103V8=Generic F103V8
# GenF1.menu.pnum.Generic_F103V8.upload.maximum_size=65536
# GenF1.menu.pnum.Generic_F103V8.upload.maximum_data_size=20480
# GenF1.menu.pnum.Generic_F103V8.build.board=GENERIC_F103V8
# GenF1.menu.pnum.Generic_F103V8.build.product_line=STM32F103xB
# GenF1.menu.pnum.Generic_F103V8.build.variant=Generic_F103Vx
# 
# GenF1.menu.pnum.Generic_F103VB=Generic F103VB
# GenF1.menu.pnum.Generic_F103VB.upload.maximum_size=131072
# GenF1.menu.pnum.Generic_F103VB.upload.maximum_data_size=20480
