Omniment-public/RECore-Arduino_Core_STM32_old/boards.txt
# GenF1.menu.pnum.Generic_F103VB.build.board=GENERIC_F103VB
# GenF1.menu.pnum.Generic_F103VB.build.product_line=STM32F103xB
# GenF1.menu.pnum.Generic_F103VB.build.variant=Generic_F103Vx
# 
# GenF1.menu.pnum.Generic_F103VC=Generic F103VC
# GenF1.menu.pnum.Generic_F103VC.upload.maximum_size=262144
# GenF1.menu.pnum.Generic_F103VC.upload.maximum_data_size=49152
# GenF1.menu.pnum.Generic_F103VC.build.board=GENERIC_F103VC
# GenF1.menu.pnum.Generic_F103VC.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103VC.build.variant=Generic_F103Vx
# 
# GenF1.menu.pnum.Generic_F103VD=Generic F103VD
# GenF1.menu.pnum.Generic_F103VD.upload.maximum_size=393216
# GenF1.menu.pnum.Generic_F103VD.upload.maximum_data_size=65536
# GenF1.menu.pnum.Generic_F103VD.build.board=GENERIC_F103VD
# GenF1.menu.pnum.Generic_F103VD.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103VD.build.variant=Generic_F103Vx
# 
# GenF1.menu.pnum.Generic_F103VE=Generic F103VE
# GenF1.menu.pnum.Generic_F103VE.upload.maximum_size=524288
# GenF1.menu.pnum.Generic_F103VE.upload.maximum_data_size=65536
# GenF1.menu.pnum.Generic_F103VE.build.board=GENERIC_F103VE
# GenF1.menu.pnum.Generic_F103VE.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103VE.build.variant=Generic_F103Vx
# 
# GenF1.menu.pnum.Generic_F103VF=Generic F103VF
# GenF1.menu.pnum.Generic_F103VF.upload.maximum_size=786432
# GenF1.menu.pnum.Generic_F103VF.upload.maximum_data_size=98304
# GenF1.menu.pnum.Generic_F103VF.build.board=GENERIC_F103VF
# GenF1.menu.pnum.Generic_F103VF.build.product_line=STM32F103xG
# GenF1.menu.pnum.Generic_F103VF.build.variant=Generic_F103Vx
# 
# GenF1.menu.pnum.Generic_F103VG=Generic F103VG
# GenF1.menu.pnum.Generic_F103VG.upload.maximum_size=1048576
# GenF1.menu.pnum.Generic_F103VG.upload.maximum_data_size=98304
# GenF1.menu.pnum.Generic_F103VG.build.board=GENERIC_F103VG
# GenF1.menu.pnum.Generic_F103VG.build.product_line=STM32F103xG
# GenF1.menu.pnum.Generic_F103VG.build.variant=Generic_F103Vx
# 
# # Generic STM32F103Zx boards
# GenF1.menu.pnum.Generic_F103ZC=Generic F103ZC
# GenF1.menu.pnum.Generic_F103ZC.upload.maximum_size=262144
# GenF1.menu.pnum.Generic_F103ZC.upload.maximum_data_size=49152
# GenF1.menu.pnum.Generic_F103ZC.build.board=Generic_F103ZC
# GenF1.menu.pnum.Generic_F103ZC.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103ZC.build.variant=Generic_F103Zx
# 
# GenF1.menu.pnum.Generic_F103ZD=Generic F103ZD
# GenF1.menu.pnum.Generic_F103ZD.upload.maximum_size=393216
# GenF1.menu.pnum.Generic_F103ZD.upload.maximum_data_size=65536
# GenF1.menu.pnum.Generic_F103ZD.build.board=Generic_F103ZC
# GenF1.menu.pnum.Generic_F103ZD.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103ZD.build.variant=Generic_F103Zx
# 
# GenF1.menu.pnum.Generic_F103ZE=Generic F103ZE
# GenF1.menu.pnum.Generic_F103ZE.upload.maximum_size=524288
# GenF1.menu.pnum.Generic_F103ZE.upload.maximum_data_size=65536
# GenF1.menu.pnum.Generic_F103ZE.build.board=Generic_F103ZE
# GenF1.menu.pnum.Generic_F103ZE.build.product_line=STM32F103xE
# GenF1.menu.pnum.Generic_F103ZE.build.variant=Generic_F103Zx
# 
# GenF1.menu.pnum.Generic_F103ZF=Generic F103ZF
# GenF1.menu.pnum.Generic_F103ZF.upload.maximum_size=786432
# GenF1.menu.pnum.Generic_F103ZF.upload.maximum_data_size=98304
# GenF1.menu.pnum.Generic_F103ZF.build.board=Generic_F103ZF
# GenF1.menu.pnum.Generic_F103ZF.build.product_line=STM32F103xG
# GenF1.menu.pnum.Generic_F103ZF.build.variant=Generic_F103Zx
# 
# GenF1.menu.pnum.Generic_F103ZG=Generic F103ZG
# GenF1.menu.pnum.Generic_F103ZG.upload.maximum_size=1048576
# GenF1.menu.pnum.Generic_F103ZG.upload.maximum_data_size=98304
# GenF1.menu.pnum.Generic_F103ZG.build.board=Generic_F103ZG
# GenF1.menu.pnum.Generic_F103ZG.build.product_line=STM32F103xG
# GenF1.menu.pnum.Generic_F103ZG.build.variant=Generic_F103Zx
# 
# # VCCGND_F103ZET6 board
# GenF1.menu.pnum.VCCGND_F103ZET6Mini=VCCGND F103ZET6 Mini
# GenF1.menu.pnum.VCCGND_F103ZET6Mini.upload.maximum_size=524288
# GenF1.menu.pnum.VCCGND_F103ZET6Mini.upload.maximum_data_size=65536
# GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.board=VCCGND_F103ZET6_MINI
# GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.product_line=STM32F103xE
# GenF1.menu.pnum.VCCGND_F103ZET6Mini.build.variant=Generic_F103Zx
# 
# GenF1.menu.pnum.VCCGND_F103ZET6=VCCGND F103ZET6
# GenF1.menu.pnum.VCCGND_F103ZET6.upload.maximum_size=524288
# GenF1.menu.pnum.VCCGND_F103ZET6.upload.maximum_data_size=65536
# GenF1.menu.pnum.VCCGND_F103ZET6.build.board=VCCGND_F103ZET6
# GenF1.menu.pnum.VCCGND_F103ZET6.build.product_line=STM32F103xE
# GenF1.menu.pnum.VCCGND_F103ZET6.build.variant=Generic_F103Zx
# 
# # HY-TinySTM103TB board
# GenF1.menu.pnum.HY_TinySTM103TB=HY-TinySTM103TB
# GenF1.menu.pnum.HY_TinySTM103TB.upload.maximum_size=131072
# GenF1.menu.pnum.HY_TinySTM103TB.upload.maximum_data_size=20480
# GenF1.menu.pnum.HY_TinySTM103TB.build.board=HY_TinySTM103TB
# GenF1.menu.pnum.HY_TinySTM103TB.build.product_line=STM32F103xB
# GenF1.menu.pnum.HY_TinySTM103TB.build.variant=HY_TinySTM103T
# 
# # MAPLEMINI_F103CB board
# GenF1.menu.pnum.MAPLEMINI_F103CB=Maple Mini F103CB
# GenF1.menu.pnum.MAPLEMINI_F103CB.upload.maximum_size=131072
# GenF1.menu.pnum.MAPLEMINI_F103CB.upload.maximum_data_size=20480
# GenF1.menu.pnum.MAPLEMINI_F103CB.build.board=MAPLEMINI_F103CB
# GenF1.menu.pnum.MAPLEMINI_F103CB.build.product_line=STM32F103xB
# GenF1.menu.pnum.MAPLEMINI_F103CB.build.variant=MAPLEMINI_F103CB
# 
# 
# # Upload menu
# GenF1.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# GenF1.menu.upload_method.swdMethod.upload.protocol=0
# GenF1.menu.upload_method.swdMethod.upload.options=-g
# GenF1.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# GenF1.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# GenF1.menu.upload_method.serialMethod.upload.protocol=1
# GenF1.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# GenF1.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# GenF1.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# GenF1.menu.upload_method.dfuMethod.upload.protocol=2
# GenF1.menu.upload_method.dfuMethod.upload.options=-g
# GenF1.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# GenF1.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
# GenF1.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
# GenF1.menu.upload_method.bmpMethod.upload.tool=bmp_upload
# 
# GenF1.menu.upload_method.hidMethod=HID Bootloader 2.2
# GenF1.menu.upload_method.hidMethod.upload.protocol=hid22
# GenF1.menu.upload_method.hidMethod.upload.tool=hid_upload
# GenF1.menu.upload_method.hidMethod.build.flash_offset=0x800
# GenF1.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}
# 
# GenF1.menu.upload_method.dfu2Method=Maple DFU Bootloader 2.0
# GenF1.menu.upload_method.dfu2Method.upload.protocol=maple
# GenF1.menu.upload_method.dfu2Method.upload.tool=maple_upload
# GenF1.menu.upload_method.dfu2Method.upload.usbID=1EAF:0003
# GenF1.menu.upload_method.dfu2Method.upload.altID=2
# GenF1.menu.upload_method.dfu2Method.build.flash_offset=0x2000
# GenF1.menu.upload_method.dfu2Method.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}
# 
# GenF1.menu.upload_method.dfuoMethod=Maple DFU Bootloader original
# GenF1.menu.upload_method.dfuoMethod.upload.protocol=maple
# GenF1.menu.upload_method.dfuoMethod.upload.tool=maple_upload
# GenF1.menu.upload_method.dfuoMethod.upload.usbID=1EAF:0003
# GenF1.menu.upload_method.dfuoMethod.upload.altID=1
# GenF1.menu.upload_method.dfuoMethod.build.flash_offset=0x5000
# GenF1.menu.upload_method.dfuoMethod.build.bootloader_flags=-DBL_LEGACY_LEAF -DVECT_TAB_OFFSET={build.flash_offset}
# 
# ################################################################################
# # Generic F3
# 
# GenF3.name=Generic STM32F3 series
# 
# GenF3.build.core=arduino
# GenF3.build.board=GenF3
# GenF3.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
# GenF3.build.mcu=cortex-m4
# GenF3.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# GenF3.build.series=STM32F3xx
# GenF3.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # BLACKPILL_F303CC
# GenF3.menu.pnum.BLACKPILL_F303CC=RobotDyn BlackPill F303CC
# GenF3.menu.pnum.BLACKPILL_F303CC.upload.maximum_size=262144
# GenF3.menu.pnum.BLACKPILL_F303CC.upload.maximum_data_size=40960
# GenF3.menu.pnum.BLACKPILL_F303CC.build.board=BLACKPILL_F303CC
# GenF3.menu.pnum.BLACKPILL_F303CC.build.product_line=STM32F303xC
# GenF3.menu.pnum.BLACKPILL_F303CC.build.variant=PILL_F303XX
# 
# # Upload menu
# GenF3.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# GenF3.menu.upload_method.swdMethod.upload.protocol=0
# GenF3.menu.upload_method.swdMethod.upload.options=-g
# GenF3.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# GenF3.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# GenF3.menu.upload_method.serialMethod.upload.protocol=1
# GenF3.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# GenF3.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# GenF3.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# GenF3.menu.upload_method.dfuMethod.upload.protocol=2
# GenF3.menu.upload_method.dfuMethod.upload.options=-g
# GenF3.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# GenF3.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
# GenF3.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
# GenF3.menu.upload_method.bmpMethod.upload.tool=bmp_upload
# 
# ################################################################################
# # Generic F4
# 
# GenF4.name=Generic STM32F4 series
# 
# GenF4.build.core=arduino
# GenF4.build.board=GenF4
# GenF4.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} {build.bootloader_flags}
# GenF4.build.mcu=cortex-m4
# GenF4.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# GenF4.build.series=STM32F4xx
# GenF4.build.cmsis_lib_gcc=arm_cortexM4lf_math
# 
# # Black F407VE
# # https://github.com/mcauser/BLACK_F407VEZ
# GenF4.menu.pnum.BLACK_F407VE=Black F407VE
# GenF4.menu.pnum.BLACK_F407VE.upload.maximum_size=524288
# GenF4.menu.pnum.BLACK_F407VE.upload.maximum_data_size=131072
# GenF4.menu.pnum.BLACK_F407VE.build.board=BLACK_F407VE
# GenF4.menu.pnum.BLACK_F407VE.build.product_line=STM32F407xx
# GenF4.menu.pnum.BLACK_F407VE.build.variant=BLACK_F407XX
# 
# # Black F407VG
# # https://github.com/mcauser/BLACK_F407VEZ with bigger chip
# GenF4.menu.pnum.BLACK_F407VG=Black F407VG
# GenF4.menu.pnum.BLACK_F407VG.upload.maximum_size=1048576
# GenF4.menu.pnum.BLACK_F407VG.upload.maximum_data_size=131072
# GenF4.menu.pnum.BLACK_F407VG.build.board=BLACK_F407VG
# GenF4.menu.pnum.BLACK_F407VG.build.product_line=STM32F407xx
# GenF4.menu.pnum.BLACK_F407VG.build.variant=BLACK_F407XX
# 
# # Black F407ZE
# # https://github.com/mcauser/BLACK_F407ZE
# GenF4.menu.pnum.BLACK_F407ZE=Black F407ZE
# GenF4.menu.pnum.BLACK_F407ZE.upload.maximum_size=524288
# GenF4.menu.pnum.BLACK_F407ZE.upload.maximum_data_size=131072
# GenF4.menu.pnum.BLACK_F407ZE.build.board=BLACK_F407ZE
# GenF4.menu.pnum.BLACK_F407ZE.build.product_line=STM32F407xx
# GenF4.menu.pnum.BLACK_F407ZE.build.variant=BLACK_F407XX
# 
# # Black F407ZG
# # https://github.com/mcauser/BLACK_F407ZG
# GenF4.menu.pnum.BLACK_F407ZG=Black F407ZG
# GenF4.menu.pnum.BLACK_F407ZG.upload.maximum_size=1048576
# GenF4.menu.pnum.BLACK_F407ZG.upload.maximum_data_size=131072
# GenF4.menu.pnum.BLACK_F407ZG.build.board=BLACK_F407ZG
# GenF4.menu.pnum.BLACK_F407ZG.build.product_line=STM32F407xx
# GenF4.menu.pnum.BLACK_F407ZG.build.variant=BLACK_F407XX
# 
# # Blue F407VE mini: http://wiki.stm32duino.com/index.php?title=Vcc-gnd.com_STM32F407VET6_Mini
# GenF4.menu.pnum.BLUE_F407VE_Mini=Blue F407VE mini
# GenF4.menu.pnum.BLUE_F407VE_Mini.upload.maximum_size=524288
# GenF4.menu.pnum.BLUE_F407VE_Mini.upload.maximum_data_size=131072
# GenF4.menu.pnum.BLUE_F407VE_Mini.build.board=BLUE_F407VE_Mini
# GenF4.menu.pnum.BLUE_F407VE_Mini.build.product_line=STM32F407xx
# GenF4.menu.pnum.BLUE_F407VE_Mini.build.variant=BLUE_F407VE_Mini
# 
# # DIYMORE STM32F407VGT board
# GenF4.menu.pnum.DIYMORE_F407VGT=DIYMORE STM32F407VGT
# GenF4.menu.pnum.DIYMORE_F407VGT.upload.maximum_size=1048576
# GenF4.menu.pnum.DIYMORE_F407VGT.upload.maximum_data_size=131072
# GenF4.menu.pnum.DIYMORE_F407VGT.build.board=DIYMORE_F407VGT
# GenF4.menu.pnum.DIYMORE_F407VGT.build.product_line=STM32F407xx
# GenF4.menu.pnum.DIYMORE_F407VGT.build.variant=DIYMORE_F407VGT
# 
# # FK407M1
# GenF4.menu.pnum.FK407M1=FK407M1 STM32F407VET
# GenF4.menu.pnum.FK407M1.upload.maximum_size=524288
# GenF4.menu.pnum.FK407M1.upload.maximum_data_size=131072
# GenF4.menu.pnum.FK407M1.build.board=FK407M1
# GenF4.menu.pnum.FK407M1.build.product_line=STM32F407xx
# GenF4.menu.pnum.FK407M1.build.variant=FK407M1
# 
# # BlackPill F401CC
# GenF4.menu.pnum.BLACKPILL_F401CC=BlackPill F401CC
# GenF4.menu.pnum.BLACKPILL_F401CC.upload.maximum_size=262144
# GenF4.menu.pnum.BLACKPILL_F401CC.upload.maximum_data_size=65536
# GenF4.menu.pnum.BLACKPILL_F401CC.build.board=BLACKPILL_F401CC
# GenF4.menu.pnum.BLACKPILL_F401CC.build.product_line=STM32F401xC
# GenF4.menu.pnum.BLACKPILL_F401CC.build.variant=Generic_F401Cx
# 
# # BlackPill F411CE
# # https://github.com/mcauser/WEACT_F411CEU6
# GenF4.menu.pnum.BLACKPILL_F411CE=BlackPill F411CE
# GenF4.menu.pnum.BLACKPILL_F411CE.upload.maximum_size=524288
# GenF4.menu.pnum.BLACKPILL_F411CE.upload.maximum_data_size=131072
# GenF4.menu.pnum.BLACKPILL_F411CE.build.board=BLACKPILL_F411CE
# GenF4.menu.pnum.BLACKPILL_F411CE.build.product_line=STM32F411xE
# GenF4.menu.pnum.BLACKPILL_F411CE.build.variant=Generic_F411Cx
# 
# # Core board F401RCT6
# # https://stm32-base.org/boards/STM32F401RCT6-STM32F-Core-Board
# GenF4.menu.pnum.CoreBoard_F401RC=Core board F401RCT6
# GenF4.menu.pnum.CoreBoard_F401RC.upload.maximum_size=262144
# GenF4.menu.pnum.CoreBoard_F401RC.upload.maximum_data_size=65536
# GenF4.menu.pnum.CoreBoard_F401RC.build.board=CoreBoard_F401RC
# GenF4.menu.pnum.CoreBoard_F401RC.build.product_line=STM32F401xC
# GenF4.menu.pnum.CoreBoard_F401RC.build.variant=Generic_F401Rx
# 
# # Adafruit Feather STM32F405 board
# GenF4.menu.pnum.FEATHER_F405=Adafruit Feather STM32F405
# GenF4.menu.pnum.FEATHER_F405.upload.maximum_size=1048576
# GenF4.menu.pnum.FEATHER_F405.upload.maximum_data_size=131072
# GenF4.menu.pnum.FEATHER_F405.build.board=FEATHER_F405
# GenF4.menu.pnum.FEATHER_F405.build.product_line=STM32F405xx
# GenF4.menu.pnum.FEATHER_F405.build.variant=FEATHER_F405
# 
# # ThunderPack F411xxE
# # https://github.com/jgillick/ThunderPack/tree/STM32F4
# GenF4.menu.pnum.THUNDERPACK_F411=ThunderPack v1.1+
# GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_size=524288
# GenF4.menu.pnum.THUNDERPACK_F411.upload.maximum_data_size=131072
# GenF4.menu.pnum.THUNDERPACK_F411.build.board=THUNDERPACK_F411
# GenF4.menu.pnum.THUNDERPACK_F411.build.product_line=STM32F411xE
# GenF4.menu.pnum.THUNDERPACK_F411.build.variant=THUNDERPACK
# 
# # Generic F446RE
# GenF4.menu.pnum.Generic_F446RE=Generic F446RE
# GenF4.menu.pnum.Generic_F446RE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F446RE.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F446RE.build.board=GENERIC_F446RE
# GenF4.menu.pnum.Generic_F446RE.build.product_line=STM32F446xx
# GenF4.menu.pnum.Generic_F446RE.build.variant=Generic_F446Rx
# 
# # Generic F446RC
# GenF4.menu.pnum.Generic_F446RC=Generic F446RC
# GenF4.menu.pnum.Generic_F446RC.upload.maximum_size=262144
# GenF4.menu.pnum.Generic_F446RC.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F446RC.build.board=GENERIC_F446RC
# GenF4.menu.pnum.Generic_F446RC.build.product_line=STM32F446xx
# GenF4.menu.pnum.Generic_F446RC.build.variant=Generic_F446Rx
# 
# # Generic F423RH
# GenF4.menu.pnum.Generic_F423RH=Generic F423RH
# GenF4.menu.pnum.Generic_F423RH.upload.maximum_size=1572864
# GenF4.menu.pnum.Generic_F423RH.upload.maximum_data_size=327680
# GenF4.menu.pnum.Generic_F423RH.build.board=GENERIC_F423RH
# GenF4.menu.pnum.Generic_F423RH.build.product_line=STM32F423xx
# GenF4.menu.pnum.Generic_F423RH.build.variant=Generic_F4x3Rx
# 
# # Generic F423CH
# GenF4.menu.pnum.Generic_F423CH=Generic F423CH
# GenF4.menu.pnum.Generic_F423CH.upload.maximum_size=1572864
# GenF4.menu.pnum.Generic_F423CH.upload.maximum_data_size=327680
# GenF4.menu.pnum.Generic_F423CH.build.board=GENERIC_F423CH
# GenF4.menu.pnum.Generic_F423CH.build.product_line=STM32F423xx
# GenF4.menu.pnum.Generic_F423CH.build.variant=Generic_F4x3Cx
# 
# # Generic F417VG
# GenF4.menu.pnum.Generic_F417VG=Generic F417VG
# GenF4.menu.pnum.Generic_F417VG.upload.maximum_size=1048576
# GenF4.menu.pnum.Generic_F417VG.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F417VG.build.board=GENERIC_F417VG
# GenF4.menu.pnum.Generic_F417VG.build.product_line=STM32F417xx
# GenF4.menu.pnum.Generic_F417VG.build.variant=Generic_F4x7Vx
# 
# # Generic F417VE
# GenF4.menu.pnum.Generic_F417VE=Generic F417VE
# GenF4.menu.pnum.Generic_F417VE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F417VE.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F417VE.build.board=GENERIC_F417VE
# GenF4.menu.pnum.Generic_F417VE.build.product_line=STM32F417xx
# GenF4.menu.pnum.Generic_F417VE.build.variant=Generic_F4x7Vx
# 
# # Generic F415RG
# GenF4.menu.pnum.Generic_F415RG=Generic F415RG
# GenF4.menu.pnum.Generic_F415RG.upload.maximum_size=1048576
# GenF4.menu.pnum.Generic_F415RG.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F415RG.build.board=GENERIC_F415RG
# GenF4.menu.pnum.Generic_F415RG.build.product_line=STM32F415xx
# GenF4.menu.pnum.Generic_F415RG.build.variant=Generic_F4x5RG
# 
# # Generic F413RH
# GenF4.menu.pnum.Generic_F413RH=Generic F413RH
# GenF4.menu.pnum.Generic_F413RH.upload.maximum_size=1572864
# GenF4.menu.pnum.Generic_F413RH.upload.maximum_data_size=327680
# GenF4.menu.pnum.Generic_F413RH.build.board=GENERIC_F413RH
