Omniment-public/RECore-Arduino_Core_STM32_old/boards.txt
# GenF4.menu.pnum.Generic_F413RH.build.product_line=STM32F413xx
# GenF4.menu.pnum.Generic_F413RH.build.variant=Generic_F4x3Rx
# 
# # Generic F413RG
# GenF4.menu.pnum.Generic_F413RG=Generic F413RG
# GenF4.menu.pnum.Generic_F413RG.upload.maximum_size=1048576
# GenF4.menu.pnum.Generic_F413RG.upload.maximum_data_size=327680
# GenF4.menu.pnum.Generic_F413RG.build.board=GENERIC_F413RG
# GenF4.menu.pnum.Generic_F413RG.build.product_line=STM32F413xx
# GenF4.menu.pnum.Generic_F413RG.build.variant=Generic_F4x3Rx
# 
# # Generic F413CH
# GenF4.menu.pnum.Generic_F413CH=Generic F413CH
# GenF4.menu.pnum.Generic_F413CH.upload.maximum_size=1572864
# GenF4.menu.pnum.Generic_F413CH.upload.maximum_data_size=327680
# GenF4.menu.pnum.Generic_F413CH.build.board=GENERIC_F413CH
# GenF4.menu.pnum.Generic_F413CH.build.product_line=STM32F413xx
# GenF4.menu.pnum.Generic_F413CH.build.variant=Generic_F4x3Cx
# 
# # Generic F413CG
# GenF4.menu.pnum.Generic_F413CG=Generic F413CG
# GenF4.menu.pnum.Generic_F413CG.upload.maximum_size=1048576
# GenF4.menu.pnum.Generic_F413CG.upload.maximum_data_size=327680
# GenF4.menu.pnum.Generic_F413CG.build.board=GENERIC_F413CG
# GenF4.menu.pnum.Generic_F413CG.build.product_line=STM32F413xx
# GenF4.menu.pnum.Generic_F413CG.build.variant=Generic_F4x3Cx
# 
# # Generic F412RG
# GenF4.menu.pnum.Generic_F412RG=Generic F412RG
# GenF4.menu.pnum.Generic_F412RG.upload.maximum_size=1048576
# GenF4.menu.pnum.Generic_F412RG.upload.maximum_data_size=262144
# GenF4.menu.pnum.Generic_F412RG.build.board=GENERIC_F412RG
# GenF4.menu.pnum.Generic_F412RG.build.product_line=STM32F412Rx
# GenF4.menu.pnum.Generic_F412RG.build.variant=Generic_F412Rx
# 
# # Generic F412RE
# GenF4.menu.pnum.Generic_F412RE=Generic F412RE
# GenF4.menu.pnum.Generic_F412RE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F412RE.upload.maximum_data_size=262144
# GenF4.menu.pnum.Generic_F412RE.build.board=GENERIC_F412RE
# GenF4.menu.pnum.Generic_F412RE.build.product_line=STM32F412Rx
# GenF4.menu.pnum.Generic_F412RE.build.variant=Generic_F412Rx
# 
# # Generic F412CG
# GenF4.menu.pnum.Generic_F412CG=Generic F412CG
# GenF4.menu.pnum.Generic_F412CG.upload.maximum_size=1048576
# GenF4.menu.pnum.Generic_F412CG.upload.maximum_data_size=262144
# GenF4.menu.pnum.Generic_F412CG.build.board=GENERIC_F412CG
# GenF4.menu.pnum.Generic_F412CG.build.product_line=STM32F412Cx
# GenF4.menu.pnum.Generic_F412CG.build.variant=Generic_F412Cx
# 
# # Generic F412CE
# GenF4.menu.pnum.Generic_F412CE=Generic F412CE
# GenF4.menu.pnum.Generic_F412CE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F412CE.upload.maximum_data_size=262144
# GenF4.menu.pnum.Generic_F412CE.build.board=GENERIC_F412CE
# GenF4.menu.pnum.Generic_F412CE.build.product_line=STM32F412Cx
# GenF4.menu.pnum.Generic_F412CE.build.variant=Generic_F412Cx
# 
# # Generic F411RE
# GenF4.menu.pnum.Generic_F411RE=Generic F411RE
# GenF4.menu.pnum.Generic_F411RE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F411RE.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F411RE.build.board=GENERIC_F411RE
# GenF4.menu.pnum.Generic_F411RE.build.product_line=STM32F411xE
# GenF4.menu.pnum.Generic_F411RE.build.variant=Generic_F411Rx
# 
# # Generic F411RC
# GenF4.menu.pnum.Generic_F411RC=Generic F411RC
# GenF4.menu.pnum.Generic_F411RC.upload.maximum_size=262144
# GenF4.menu.pnum.Generic_F411RC.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F411RC.build.board=GENERIC_F411RC
# GenF4.menu.pnum.Generic_F411RC.build.product_line=STM32F411xE
# GenF4.menu.pnum.Generic_F411RC.build.variant=Generic_F411Rx
# 
# # Generic F411CE
# GenF4.menu.pnum.Generic_F411CE=Generic F411CE
# GenF4.menu.pnum.Generic_F411CE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F411CE.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F411CE.build.board=GENERIC_F411CE
# GenF4.menu.pnum.Generic_F411CE.build.product_line=STM32F411xE
# GenF4.menu.pnum.Generic_F411CE.build.variant=Generic_F411Cx
# 
# # Generic F411CC
# GenF4.menu.pnum.Generic_F411CC=Generic F411CC
# GenF4.menu.pnum.Generic_F411CC.upload.maximum_size=262144
# GenF4.menu.pnum.Generic_F411CC.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F411CC.build.board=GENERIC_F411CC
# GenF4.menu.pnum.Generic_F411CC.build.product_line=STM32F411xE
# GenF4.menu.pnum.Generic_F411CC.build.variant=Generic_F411Cx
# 
# # Generic F410RB
# GenF4.menu.pnum.Generic_F410RB=Generic F410RB
# GenF4.menu.pnum.Generic_F410RB.upload.maximum_size=131072
# GenF4.menu.pnum.Generic_F410RB.upload.maximum_data_size=32768
# GenF4.menu.pnum.Generic_F410RB.build.board=GENERIC_F410RB
# GenF4.menu.pnum.Generic_F410RB.build.product_line=STM32F410Rx
# GenF4.menu.pnum.Generic_F410RB.build.variant=Generic_F410Rx
# 
# # Generic F410R8
# GenF4.menu.pnum.Generic_F410R8=Generic F410R8
# GenF4.menu.pnum.Generic_F410R8.upload.maximum_size=65536
# GenF4.menu.pnum.Generic_F410R8.upload.maximum_data_size=32768
# GenF4.menu.pnum.Generic_F410R8.build.board=GENERIC_F410R8
# GenF4.menu.pnum.Generic_F410R8.build.product_line=STM32F410Rx
# GenF4.menu.pnum.Generic_F410R8.build.variant=Generic_F410Rx
# 
# # Generic F410CB
# GenF4.menu.pnum.Generic_F410CB=Generic F410CB
# GenF4.menu.pnum.Generic_F410CB.upload.maximum_size=131072
# GenF4.menu.pnum.Generic_F410CB.upload.maximum_data_size=32768
# GenF4.menu.pnum.Generic_F410CB.build.board=GENERIC_F410CB
# GenF4.menu.pnum.Generic_F410CB.build.product_line=STM32F410Cx
# GenF4.menu.pnum.Generic_F410CB.build.variant=Generic_F410Cx
# 
# # Generic F410C8
# GenF4.menu.pnum.Generic_F410C8=Generic F410C8
# GenF4.menu.pnum.Generic_F410C8.upload.maximum_size=65536
# GenF4.menu.pnum.Generic_F410C8.upload.maximum_data_size=32768
# GenF4.menu.pnum.Generic_F410C8.build.board=GENERIC_F410C8
# GenF4.menu.pnum.Generic_F410C8.build.product_line=STM32F410Cx
# GenF4.menu.pnum.Generic_F410C8.build.variant=Generic_F410Cx
# 
# # Generic F407VG
# GenF4.menu.pnum.Generic_F407VG=Generic F407VG
# GenF4.menu.pnum.Generic_F407VG.upload.maximum_size=1048576
# GenF4.menu.pnum.Generic_F407VG.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F407VG.build.board=GENERIC_F407VG
# GenF4.menu.pnum.Generic_F407VG.build.product_line=STM32F407xx
# GenF4.menu.pnum.Generic_F407VG.build.variant=Generic_F4x7Vx
# 
# # Generic F407VE
# GenF4.menu.pnum.Generic_F407VE=Generic F407VE
# GenF4.menu.pnum.Generic_F407VE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F407VE.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F407VE.build.board=GENERIC_F407VE
# GenF4.menu.pnum.Generic_F407VE.build.product_line=STM32F407xx
# GenF4.menu.pnum.Generic_F407VE.build.variant=Generic_F4x7Vx
# 
# # Generic F405RG
# GenF4.menu.pnum.Generic_F405RG=Generic F405RG
# GenF4.menu.pnum.Generic_F405RG.upload.maximum_size=1048576
# GenF4.menu.pnum.Generic_F405RG.upload.maximum_data_size=131072
# GenF4.menu.pnum.Generic_F405RG.build.board=GENERIC_F405RG
# GenF4.menu.pnum.Generic_F405RG.build.product_line=STM32F405xx
# GenF4.menu.pnum.Generic_F405RG.build.variant=Generic_F4x5RG
# 
# # Generic F401RE
# GenF4.menu.pnum.Generic_F401RE=Generic F401RE
# GenF4.menu.pnum.Generic_F401RE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F401RE.upload.maximum_data_size=98304
# GenF4.menu.pnum.Generic_F401RE.build.board=GENERIC_F401RE
# GenF4.menu.pnum.Generic_F401RE.build.product_line=STM32F401xE
# GenF4.menu.pnum.Generic_F401RE.build.variant=Generic_F401Rx
# 
# # Generic F401RD
# GenF4.menu.pnum.Generic_F401RD=Generic F401RD
# GenF4.menu.pnum.Generic_F401RD.upload.maximum_size=393216
# GenF4.menu.pnum.Generic_F401RD.upload.maximum_data_size=98304
# GenF4.menu.pnum.Generic_F401RD.build.board=GENERIC_F401RD
# GenF4.menu.pnum.Generic_F401RD.build.product_line=STM32F401xE
# GenF4.menu.pnum.Generic_F401RD.build.variant=Generic_F401Rx
# 
# # Generic F401RC
# GenF4.menu.pnum.Generic_F401RC=Generic F401RC
# GenF4.menu.pnum.Generic_F401RC.upload.maximum_size=262144
# GenF4.menu.pnum.Generic_F401RC.upload.maximum_data_size=65536
# GenF4.menu.pnum.Generic_F401RC.build.board=GENERIC_F401RC
# GenF4.menu.pnum.Generic_F401RC.build.product_line=STM32F401xC
# GenF4.menu.pnum.Generic_F401RC.build.variant=Generic_F401Rx
# 
# # Generic F401RB
# GenF4.menu.pnum.Generic_F401RB=Generic F401RB
# GenF4.menu.pnum.Generic_F401RB.upload.maximum_size=131072
# GenF4.menu.pnum.Generic_F401RB.upload.maximum_data_size=65536
# GenF4.menu.pnum.Generic_F401RB.build.board=GENERIC_F401RB
# GenF4.menu.pnum.Generic_F401RB.build.product_line=STM32F401xC
# GenF4.menu.pnum.Generic_F401RB.build.variant=Generic_F401Rx
# 
# # Generic F401CE
# GenF4.menu.pnum.Generic_F401CE=Generic F401CE
# GenF4.menu.pnum.Generic_F401CE.upload.maximum_size=524288
# GenF4.menu.pnum.Generic_F401CE.upload.maximum_data_size=98304
# GenF4.menu.pnum.Generic_F401CE.build.board=GENERIC_F401CE
# GenF4.menu.pnum.Generic_F401CE.build.product_line=STM32F401xE
# GenF4.menu.pnum.Generic_F401CE.build.variant=Generic_F401Cx
# 
# # Generic F401CD
# GenF4.menu.pnum.Generic_F401CD=Generic F401CD
# GenF4.menu.pnum.Generic_F401CD.upload.maximum_size=393216
# GenF4.menu.pnum.Generic_F401CD.upload.maximum_data_size=98304
# GenF4.menu.pnum.Generic_F401CD.build.board=GENERIC_F401CD
# GenF4.menu.pnum.Generic_F401CD.build.product_line=STM32F401xE
# GenF4.menu.pnum.Generic_F401CD.build.variant=Generic_F401Cx
# 
# # Generic F401CC
# GenF4.menu.pnum.Generic_F401CC=Generic F401CC
# GenF4.menu.pnum.Generic_F401CC.upload.maximum_size=262144
# GenF4.menu.pnum.Generic_F401CC.upload.maximum_data_size=65536
# GenF4.menu.pnum.Generic_F401CC.build.board=GENERIC_F401CC
# GenF4.menu.pnum.Generic_F401CC.build.product_line=STM32F401xC
# GenF4.menu.pnum.Generic_F401CC.build.variant=Generic_F401Cx
# 
# # Generic F401CB
# GenF4.menu.pnum.Generic_F401CB=Generic F401CB
# GenF4.menu.pnum.Generic_F401CB.upload.maximum_size=131072
# GenF4.menu.pnum.Generic_F401CB.upload.maximum_data_size=65536
# GenF4.menu.pnum.Generic_F401CB.build.board=GENERIC_F401CB
# GenF4.menu.pnum.Generic_F401CB.build.product_line=STM32F401xC
# GenF4.menu.pnum.Generic_F401CB.build.variant=Generic_F401Cx
# 
# # Upload menu
# GenF4.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# GenF4.menu.upload_method.swdMethod.upload.protocol=0
# GenF4.menu.upload_method.swdMethod.upload.options=-g
# GenF4.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# GenF4.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# GenF4.menu.upload_method.serialMethod.upload.protocol=1
# GenF4.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# GenF4.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# GenF4.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# GenF4.menu.upload_method.dfuMethod.upload.protocol=2
# GenF4.menu.upload_method.dfuMethod.upload.options=-g
# GenF4.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# GenF4.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
# GenF4.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
# GenF4.menu.upload_method.bmpMethod.upload.tool=bmp_upload
# 
# GenF4.menu.upload_method.hidMethod=HID Bootloader 2.2
# GenF4.menu.upload_method.hidMethod.upload.protocol=hid22
# GenF4.menu.upload_method.hidMethod.upload.tool=hid_upload
# GenF4.menu.upload_method.hidMethod.build.flash_offset=0x4000
# GenF4.menu.upload_method.hidMethod.build.bootloader_flags=-DBL_HID -DVECT_TAB_OFFSET={build.flash_offset}
# 
# ################################################################################
# # Generic H7
# GenH7.name=Generic STM32H7 Series
# 
# GenH7.build.core=arduino
# GenH7.build.board=GenH7
# GenH7.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial}
# GenH7.build.cmsis_lib_gcc=arm_cortexM7lfsp_math
# GenH7.build.flags.fp=-mfpu=fpv4-sp-d16 -mfloat-abi=hard
# GenH7.build.series=STM32H7xx
# GenH7.build.mcu=cortex-m7
# 
# # Daisy Seed board
# GenH7.menu.pnum.DAISY_SEED=Daisy Seed
# GenH7.menu.pnum.DAISY_SEED.upload.maximum_size=131072
# GenH7.menu.pnum.DAISY_SEED.upload.maximum_data_size=524288
# GenH7.menu.pnum.DAISY_SEED.build.board=DAISY_SEED
# GenH7.menu.pnum.DAISY_SEED.build.product_line=STM32H750xx
# GenH7.menu.pnum.DAISY_SEED.build.variant=DAISY_SEED
# 
# # Upload menu
# GenH7.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# GenH7.menu.upload_method.swdMethod.upload.protocol=0
# GenH7.menu.upload_method.swdMethod.upload.options=-g
# GenH7.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# GenH7.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# GenH7.menu.upload_method.serialMethod.upload.protocol=1
# GenH7.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# GenH7.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# GenH7.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# GenH7.menu.upload_method.dfuMethod.upload.protocol=2
# GenH7.menu.upload_method.dfuMethod.upload.options=-g
# GenH7.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# ################################################################################
# # Generic L0
# GenL0.name=Generic STM32L0 series
# 
# GenL0.build.core=arduino
# GenL0.build.board=GenL0
# GenL0.build.extra_flags=-D{build.product_line} {build.enable_usb} {build.xSerial} -D__CORTEX_SC=0
# GenL0.build.mcu=cortex-m0plus
# GenL0.build.series=STM32L0xx
# GenL0.build.cmsis_lib_gcc=arm_cortexM0l_math
# 
# # ThunderPack
# GenL0.menu.pnum.THUNDERPACK_L072=ThunderPack v1.0
# GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_size=196608
# GenL0.menu.pnum.THUNDERPACK_L072.upload.maximum_data_size=20480
# GenL0.menu.pnum.THUNDERPACK_L072.build.board=THUNDERPACK_L072
# GenL0.menu.pnum.THUNDERPACK_L072.build.product_line=STM32L072xx
# GenL0.menu.pnum.THUNDERPACK_L072.build.variant=THUNDERPACK
# 
# # Piconomix PX-HER0 board
# GenL0.menu.pnum.PX_HER0=PX-HER0
# GenL0.menu.pnum.PX_HER0.upload.maximum_size=131072
# GenL0.menu.pnum.PX_HER0.upload.maximum_data_size=20480
# GenL0.menu.pnum.PX_HER0.build.board=PX_HER0
# GenL0.menu.pnum.PX_HER0.build.product_line=STM32L072xx
# GenL0.menu.pnum.PX_HER0.build.variant=PX_HER0
# 
# # Upload menu
# GenL0.menu.upload_method.swdMethod=STM32CubeProgrammer (SWD)
# GenL0.menu.upload_method.swdMethod.upload.protocol=0
# GenL0.menu.upload_method.swdMethod.upload.options=-g
# GenL0.menu.upload_method.swdMethod.upload.tool=stm32CubeProg
# 
# GenL0.menu.upload_method.serialMethod=STM32CubeProgrammer (Serial)
# GenL0.menu.upload_method.serialMethod.upload.protocol=1
# GenL0.menu.upload_method.serialMethod.upload.options={serial.port.file} -s
# GenL0.menu.upload_method.serialMethod.upload.tool=stm32CubeProg
# 
# GenL0.menu.upload_method.dfuMethod=STM32CubeProgrammer (DFU)
# GenL0.menu.upload_method.dfuMethod.upload.protocol=2
# GenL0.menu.upload_method.dfuMethod.upload.options=-g
# GenL0.menu.upload_method.dfuMethod.upload.tool=stm32CubeProg
# 
# GenL0.menu.upload_method.bmpMethod=BMP (Black Magic Probe)
# GenL0.menu.upload_method.bmpMethod.upload.protocol=gdb_bmp
# GenL0.menu.upload_method.bmpMethod.upload.tool=bmp_upload
# 
##############################################################################

# OMNIMENT RECORE BOARD
# recore board

recore_f072.name=RECore
recore_f072.build.core=arduino
recore_f072.build.board=recore_f072

# RECore f072 SafeStart
recore_f072.menu.pnum.RECORE_F072=RECore
recore_f072.menu.pnum.RECORE_F072.upload.maximum_data_size=16384
recore_f072.menu.pnum.RECORE_F072.upload.maximum_size=65536

